RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
/**
 *******************************************************************************
 * @file  hc32_ll_eth.c
 * @brief This file provides firmware functions to manage the Ethernet MAC
 *        Controller(ETH).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_eth.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_ETH ETH
 * @brief Initial Configuration Driver Library
 * @{
 */

#if (LL_ETH_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ETH_Local_Macros ETH Local Macros
 * @{
 */

/* Ethernet register Mask */
#define ETH_MAC_IFCONFR_CLR_MASK                    (ETH_MAC_IFCONFR_RCKINV | ETH_MAC_IFCONFR_TCKINV)
#define ETH_MAC_CONFIGR_CLR_MASK                    (0x72CF7EF0UL)
#define ETH_MAC_FLOCTLR_CLR_MASK                    (0xFFFF00BEUL)
#define ETH_MAC_FLTCTLR_CLR_MASK                    (0x802107FFUL)
#define ETH_MAC_SMIADDR_CLR_MASK                    (0x0000FFC3UL)
#define ETH_DMA_BUSMODR_CLR_MASK                    (0x0FFFFFFEUL)
#define ETH_DMA_OPRMODR_CLR_MASK                    (0x0721C0FCUL)
#define ETH_PTP_TSPCTLR_CLR_MASK                    (0x0007FE02UL)

/* Ethernet MAC Address byte length */
#define ETH_MAC_ADDR_BYTE_LEN                       (6U)
/* Ethernet DMA Tx descriptors Collision Count Shift */
#define ETH_DMA_TXDESC_COLLISION_CNT_SHIFT          (3UL)
/* Ethernet DMA Rx descriptors Frame Length Shift */
#define ETH_DMA_RXDESC_FRAME_LEN_SHIFT              (16UL)
/* Ethernet DMA Tx/Rx descriptors Buffer2 Size Shift */
#define ETH_DMA_DESC_BUF2_SIZE_SHIFT                (16UL)
/* Ethernet Remote Wake-up frame register length */
#define ETH_WAKEUP_REG_LEN                          (8U)
/* Ethernet PTP PPS channel 1 time register address Shift */
#define ETH_PTP_PPS1_TIME_REG_ADDR_SHIFT            (0x64U)

/* Wait timeout(ms) */
#define ETH_WR_REG_TIMEOUT                          (50UL)
#define ETH_SW_RST_TIMEOUT                          (200UL)
#define ETH_LINK_STATUS_TIMEOUT                     (3000UL)
#define ETH_AUTO_NEGO_CPLT_TIMEOUT                  (1000UL)

/** Get the specified register address */
#define ETH_MAC_MACADHR_ADDR(__SHIFT__)             (__IO uint32_t *)((uint32_t)(&(CM_ETH->MAC_MACADHR0)) + \
                                                                      (uint32_t)(__SHIFT__))
#define ETH_MAC_MACADLR_ADDR(__SHIFT__)             (__IO uint32_t *)((uint32_t)(&(CM_ETH->MAC_MACADLR0)) + \
                                                                      (uint32_t)(__SHIFT__))
#define ETH_PTP_TMTSECR_ADDR(__SHIFT__)             (__IO uint32_t *)((uint32_t)(&(CM_ETH->PTP_TMTSECR0)) + \
                                                                      (uint32_t)(__SHIFT__))
#define ETH_PTP_TMTNSER_ADDR(__SHIFT__)             (__IO uint32_t *)((uint32_t)(&(CM_ETH->PTP_TMTNSER0)) + \
                                                                      (uint32_t)(__SHIFT__))

/**
 * @defgroup ETH_Check_Parameters_Validity ETH Check Parameters Validity
 * @{
 */
#define IS_ETH_PHY_ADDR(x)                                  ((x) < 0x20U)
#define IS_ETH_PHY_REG(x)                                   ((x) < 0x20U)

#define IS_ETH_AUTO_NEGO(x)                                                    \
(   ((x) == ETH_AUTO_NEGO_DISABLE)                          ||                 \
    ((x) == ETH_AUTO_NEGO_ENABLE))

#define IS_ETH_MAC_IF(x)                                                       \
(   ((x) == ETH_MAC_IF_MII)                                 ||                 \
    ((x) == ETH_MAC_IF_RMII))

#define IS_ETH_MAC_SPEED(x)                                                    \
(   ((x) == ETH_MAC_SPEED_10M)                              ||                 \
    ((x) == ETH_MAC_SPEED_100M))

#define IS_ETH_MAC_DUPLEX_MD(x)                                                \
(   ((x) == ETH_MAC_DUPLEX_MD_HALF)                         ||                 \
    ((x) == ETH_MAC_DUPLEX_MD_FULL))

#define IS_ETH_MAC_CHECKSUM_MD(x)                                              \
(   ((x) == ETH_MAC_CHECKSUM_MD_SW)                         ||                 \
    ((x) == ETH_MAC_CHECKSUM_MD_HW))

#define IS_ETH_RX_MD(x)                                                        \
(   ((x) == ETH_RX_MD_POLLING)                              ||                 \
    ((x) == ETH_RX_MD_INT))

#define IS_ETH_MAC_TX_CLK_POLARITY(x)                                          \
(   ((x) == ETH_MAC_TX_CLK_POLARITY_KEEP)                   ||                 \
    ((x) == ETH_MAC_TX_CLK_POLARITY_INVERSE))

#define IS_ETH_MAC_RX_CLK_POLARITY(x)                                          \
(   ((x) == ETH_MAC_RX_CLK_POLARITY_KEEP)                   ||                 \
    ((x) == ETH_MAC_RX_CLK_POLARITY_INVERSE))

#define IS_ETH_MAC_SRC_ADDR_MD(x)                                              \
(   ((x) == ETH_MAC_SRC_ADDR_MD_BY_DMA_TXDESC)              ||                 \
    ((x) == ETH_MAC_SRC_ADDR_MD_INSTER_MACADDR0)            ||                 \
    ((x) == ETH_MAC_SRC_ADDR_MD_REPLACE_MACADDR0)           ||                 \
    ((x) == ETH_MAC_SRC_ADDR_MD_INSTER_MACADDR1)            ||                 \
    ((x) == ETH_MAC_SRC_ADDR_MD_REPLACE_MACADDR1))

#define IS_ETH_MAC_TYPE_FRAME_STRIP_FCS(x)                                     \
(   ((x) == ETH_MAC_TYPE_FRAME_STRIP_FCS_DISABLE)           ||                 \
    ((x) == ETH_MAC_TYPE_FRAME_STRIP_FCS_ENABLE))

#define IS_ETH_MAC_WATCHDOG(x)                                                 \
(   ((x) == ETH_MAC_WATCHDOG_DISABLE)                       ||                 \
    ((x) == ETH_MAC_WATCHDOG_ENABLE))

