RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
#define IS_ETH_MAC_JABBER(x)                                                   \
(   ((x) == ETH_MAC_JABBER_DISABLE)                         ||                 \
    ((x) == ETH_MAC_JABBER_ENABLE))

#define IS_ETH_MAC_INTERFRAME_GAP(x)                                           \
(   ((x) == ETH_MAC_INTERFRAME_GAP_96BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_88BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_80BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_72BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_64BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_56BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_48BIT)                   ||                 \
    ((x) == ETH_MAC_INTERFRAME_GAP_40BIT))

#define IS_ETH_MAC_CARRIER_SENSE(x)                                            \
(   ((x) == ETH_MAC_CARRIER_SENSE_DISABLE)                  ||                 \
    ((x) == ETH_MAC_CARRIER_SENSE_ENABLE))

#define IS_ETH_MAC_RX_OWN(x)                                                   \
(   ((x) == ETH_MAC_RX_OWN_DISABLE)                         ||                 \
    ((x) == ETH_MAC_RX_OWN_ENABLE))

#define IS_ETH_MAC_CHECKSUM_OFFLOAD(x)                                         \
(   ((x) == ETH_MAC_CHECKSUM_OFFLOAD_DISABLE)               ||                 \
    ((x) == ETH_MAC_CHECKSUM_OFFLOAD_ENABLE))

#define IS_ETH_MAC_RETRY_TRANS(x)                                              \
(   ((x) == ETH_MAC_RETRY_TRANS_DISABLE)                    ||                 \
    ((x) == ETH_MAC_RETRY_TRANS_ENABLE))

#define IS_ETH_MAC_AUTO_STRIP_PAD_FCS(x)                                       \
(   ((x) == ETH_MAC_AUTO_STRIP_PAD_FCS_DISABLE)             ||                 \
    ((x) == ETH_MAC_AUTO_STRIP_PAD_FCS_ENABLE))

#define IS_ETH_MAC_BACKOFF_LIMIT(x)                                            \
(   ((x) == ETH_MAC_BACKOFF_LIMIT10)                        ||                 \
    ((x) == ETH_MAC_BACKOFF_LIMIT8)                         ||                 \
    ((x) == ETH_MAC_BACKOFF_LIMIT4)                         ||                 \
    ((x) == ETH_MAC_BACKOFF_LIMIT1))

#define IS_ETH_MAC_DEFERRAL_CHECK(x)                                           \
(   ((x) == ETH_MAC_DEFERRAL_CHECK_DISABLE)                 ||                 \
    ((x) == ETH_MAC_DEFERRAL_CHECK_ENABLE))

#define IS_ETH_MAC_ZERO_QUANTA_PAUSE(x)                                        \
(   ((x) == ETH_MAC_ZERO_QUANTA_PAUSE_DISABLE)              ||                 \
    ((x) == ETH_MAC_ZERO_QUANTA_PAUSE_ENABLE))

#define IS_ETH_MAC_PAUSE_LOW_THRESHOLD(x)                                      \
(   ((x) == ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS4)             ||                 \
    ((x) == ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS28)            ||                 \
    ((x) == ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS144)           ||                 \
    ((x) == ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS256))

#define IS_ETH_MAC_UNICAST_PAUSE_FRAME_DETECT(x)                               \
(   ((x) == ETH_MAC_UNICAST_PAUSE_FRAME_DETECT_DISABLE)     ||                 \
    ((x) == ETH_MAC_UNICAST_PAUSE_FRAME_DETECT_ENABLE))

#define IS_ETH_MAC_RX_FLOW_CTRL(x)                                             \
(   ((x) == ETH_MAC_RX_FLOW_CTRL_DISABLE)                   ||                 \
    ((x) == ETH_MAC_RX_FLOW_CTRL_ENABLE))

#define IS_ETH_MAC_TRANS_FLOW_CTRL(x)                                          \
(   ((x) == ETH_MAC_TRANS_FLOW_CTRL_DISABLE)                ||                 \
    ((x) == ETH_MAC_TRANS_FLOW_CTRL_ENABLE))

#define IS_ETH_MAC_RX_ALL(x)                                                   \
(   ((x) == ETH_MAC_RX_ALL_DISABLE)                         ||                 \
    ((x) == ETH_MAC_RX_ALL_ENABLE))

#define IS_ETH_MAC_DROP_NOT_TCPUDP(x)                                          \
(   ((x) == ETH_MAC_DROP_NOT_TCPUDP_DISABLE)                ||                 \
    ((x) == ETH_MAC_DROP_NOT_TCPUDP_ENABLE))

#define IS_ETH_MAC_VLAN_TAG_FILTER(x)                                          \
(   ((x) == ETH_MAC_VLAN_TAG_FILTER_DISABLE)                ||                 \
    ((x) == ETH_MAC_VLAN_TAG_FILTER_ENABLE))

#define IS_ETH_MAC_SRC_ADDR_FILTER(x)                                          \
(   ((x) == ETH_MAC_SRC_ADDR_FILTER_DISABLE)                ||                 \
    ((x) == ETH_MAC_SRC_ADDR_FILTER_NORMAL)                 ||                 \
    ((x) == ETH_MAC_SRC_ADDR_FILTER_INVERSE))

#define IS_ETH_MAC_PASS_CTRL_FRAME(x)                                          \
(   ((x) == ETH_MAC_PASS_CTRL_FRAME_BLOCK_ALL)              ||                 \
    ((x) == ETH_MAC_PASS_CTRL_FRAME_FORWARD_NOT_PAUSE)      ||                 \
    ((x) == ETH_MAC_PASS_CTRL_FRAME_FORWARD_ALL)            ||                 \
    ((x) == ETH_MAC_PASS_CTRL_FRAME_FORWARD_PASS_FILTER))

#define IS_ETH_MAC_BROADCAST_FRAME(x)                                          \
(   ((x) == ETH_MAC_RX_BROADCAST_FRAME_DISABLE)             ||                 \
    ((x) == ETH_MAC_RX_BROADCAST_FRAME_ENABLE))

#define IS_ETH_MAC_DEST_ADDR_FILTER(x)                                         \
(   ((x) == ETH_MAC_DEST_ADDR_FILTER_NORMAL)                ||                 \
    ((x) == ETH_MAC_DEST_ADDR_FILTER_INVERSE))

#define IS_ETH_MAC_MULTICAST_FRAME_FILTER(x)                                   \
(   ((x) == ETH_MAC_MULTICAST_FRAME_FILTER_NONE)            ||                 \
    ((x) == ETH_MAC_MULTICAST_FRAME_FILTER_PERFECT)         ||                 \
    ((x) == ETH_MAC_MULTICAST_FRAME_FILTER_HASHTABLE)       ||                 \
    ((x) == ETH_MAC_MULTICAST_FRAME_FILTER_PERFECT_HASHTABLE))

#define IS_ETH_MAC_UNICAST_FRAME_FILTER(x)                                     \
(   ((x) == ETH_MAC_UNICAST_FRAME_FILTER_PERFECT)           ||                 \
    ((x) == ETH_MAC_UNICAST_FRAME_FILTER_HASHTABLE)         ||                 \
    ((x) == ETH_MAC_UNICAST_FRAME_FILTER_PERFECT_HASHTABLE))

#define IS_ETH_MAC_PROMISCUOUS_MD(x)                                           \
(   ((x) == ETH_MAC_PROMISCUOUS_MD_DISABLE)                 ||                 \
    ((x) == ETH_MAC_PROMISCUOUS_MD_ENABLE))

