RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
#define IS_ETH_MAC_TXVLAN_MD(x)                                                \
(   ((x) == ETH_MAC_TXVLAN_MD_BY_DMA_TXDESC)                ||                 \
    ((x) == ETH_MAC_TXVLAN_MD_BYPASS)                       ||                 \
    ((x) == ETH_MAC_TXVLAN_MD_REMOVE_TAG)                   ||                 \
    ((x) == ETH_MAC_TXVLAN_MD_INSERT_TAG)                   ||                 \
    ((x) == ETH_MAC_TXVLAN_MD_REPLACE_TAG))

#define IS_ETH_MAC_RXVLAN_FILTER(x)                                            \
(   ((x) == ETH_MAC_RXVLAN_FILTER_NORMAL)                   ||                 \
    ((x) == ETH_MAC_RXVLAN_FILTER_INVERSE)                  ||                 \
    ((x) == ETH_MAC_RXVLAN_FILTER_NORMAL_HASHTABLE)         ||                 \
    ((x) == ETH_MAC_RXVLAN_FILTER_INVERSE_HASHTABLE))

#define IS_ETH_MAC_RXVLAN_CMP(x)                                               \
(   ((x) == ETH_MAC_RXVLAN_CMP_16BIT)                       ||                 \
    ((x) == ETH_MAC_RXVLAN_CMP_12BIT))

#define IS_ETH_MAC_L4_DEST_PORT_FILTER(x)                                      \
(   ((x) == ETH_MAC_L4_DEST_PORT_FILTER_DISABLE)            ||                 \
    ((x) == ETH_MAC_L4_DEST_PORT_FILTER_NORMAL)             ||                 \
    ((x) == ETH_MAC_L4_DEST_PORT_FILTER_INVERSE))

#define IS_ETH_MAC_L4_SRC_PORT_FILTER(x)                                       \
(   ((x) == ETH_MAC_L4_SRC_PORT_FILTER_DISABLE)             ||                 \
    ((x) == ETH_MAC_L4_SRC_PORT_FILTER_NORMAL)              ||                 \
    ((x) == ETH_MAC_L4_SRC_PORT_FILTER_INVERSE))

#define IS_ETH_MAC_L4_PORT_FILTER_PROTOCOL(x)                                  \
(   ((x) == ETH_MAC_L4_PORT_FILTER_PROTOCOL_TCP)            ||                 \
    ((x) == ETH_MAC_L4_PORT_FILTER_PROTOCOL_UDP))

#define IS_ETH_MAC_L3_DEST_ADDR_FILTER_MASK(x)                                 \
(   ((x) | ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT30_0) ==                        \
    ETH_MAC_L3_DEST_ADDR_FILTER_MASK_BIT30_0)

#define IS_ETH_MAC_L3_SRC_ADDR_FILTER_MASK(x)                                  \
(   ((x) | ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT30_0) ==                         \
    ETH_MAC_L3_SRC_ADDR_FILTER_MASK_BIT30_0)

#define IS_ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK(x)                             \
(   ((x) | ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT126_0) ==                   \
    ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_BIT126_0)

#define IS_ETH_MAC_L3_DEST_ADDR_FILTER(x)                                      \
(   ((x) == ETH_MAC_L3_DEST_ADDR_FILTER_DISABLE)            ||                 \
    ((x) == ETH_MAC_L3_DEST_ADDR_FILTER_NORMAL)             ||                 \
    ((x) == ETH_MAC_L3_DEST_ADDR_FILTER_INVERSE))

#define IS_ETH_MAC_L3_SRC_ADDR_FILTER(x)                                       \
(   ((x) == ETH_MAC_L3_SRC_ADDR_FILTER_DISABLE)             ||                 \
    ((x) == ETH_MAC_L3_SRC_ADDR_FILTER_NORMAL)              ||                 \
    ((x) == ETH_MAC_L3_SRC_ADDR_FILTER_INVERSE))

#define IS_ETH_MAC_L3_ADDR_FILTER_PROTOCOL(x)                                  \
(   ((x) == ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4)           ||                 \
    ((x) == ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV6))

#define IS_ETH_MAC_ADDR_NORMAL_INDEX(x)                                        \
(   ((x) == ETH_MAC_ADDR_IDX0)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX1)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX2)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX3)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX4))

#define IS_ETH_MAC_ADDR_SPEC_INDEX(x)                                          \
(   ((x) == ETH_MAC_ADDR_IDX1)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX2)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX3)                              ||                 \
    ((x) == ETH_MAC_ADDR_IDX4))

#define IS_ETH_MAC_ADDR_FILTER(x)                                              \
(   ((x) == ETH_MAC_ADDR_FILTER_DISABLE)                    ||                 \
    ((x) == ETH_MAC_ADDR_FILTER_PERFECT_DEST_ADDR)          ||                 \
    ((x) == ETH_MAC_ADDR_FILTER_PERFECT_SRC_ADDR))

#define IS_ETH_MAC_ADDR_MASK(x)                                                \
(   ((x) | ETH_MAC_ADDR_MASK_ALL) == ETH_MAC_ADDR_MASK_ALL)

#define IS_ETH_MAC_INT_FLAG(x)                                                 \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_MAC_INT_FLAG_ALL) == ETH_MAC_INT_FLAG_ALL))

#define IS_ETH_MAC_INT(x)                                                      \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_MAC_INT_ALL) == ETH_MAC_INT_ALL))

#define IS_ETH_DMA_BURST_MD(x)                                                 \
(   ((x) == ETH_DMA_BURST_MD_NORMAL)                        ||                 \
    ((x) == ETH_DMA_BURST_MD_FIXED)                         ||                 \
    ((x) == ETH_DMA_BURST_MD_MIXED))

#define IS_ETH_DMA_ADDR_ALIGN(x)                                               \
(   ((x) == ETH_DMA_ADDR_ALIGN_DISABLE)                     ||                 \
    ((x) == ETH_DMA_ADDR_ALIGN_ENABLE))

#define IS_ETH_DMA_RX_BURST_LEN(x)                                             \
(   ((x) == ETH_DMA_RX_BURST_LEN_1BEAT)                     ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_2BEAT)                     ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_4BEAT)                     ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8BEAT)                     ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_16BEAT)                    ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_32BEAT)                    ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8XPBL_8BEAT)               ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8XPBL_16BEAT)              ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8XPBL_32BEAT)              ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8XPBL_64BEAT)              ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8XPBL_128BEAT)             ||                 \
    ((x) == ETH_DMA_RX_BURST_LEN_8XPBL_256BEAT))

#define IS_ETH_DMA_TX_BURST_LEN(x)                                             \
(   ((x) == ETH_DMA_TX_BURST_LEN_1BEAT)                     ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_2BEAT)                     ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_4BEAT)                     ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8BEAT)                     ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_16BEAT)                    ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_32BEAT)                    ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8XPBL_8BEAT)               ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8XPBL_16BEAT)              ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8XPBL_32BEAT)              ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8XPBL_64BEAT)              ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8XPBL_128BEAT)             ||                 \
    ((x) == ETH_DMA_TX_BURST_LEN_8XPBL_256BEAT))

#define IS_ETH_DMA_ENHANCE_DESC(x)                                             \
(   ((x) == ETH_DMA_ENHANCE_DESC_DISABLE)                   ||                 \
    ((x) == ETH_DMA_ENHANCE_DESC_ENABLE))

#define IS_ETH_DMA_DESC_SKIP_LEN(x)                         ((x) < 0x20U)

#define IS_ETH_DMA_PRIO_ARBITRATION(x)                                         \
(   ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_1_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_2_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_3_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_RXTX_4_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_1_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_2_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_3_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_LOOP_TXRX_4_1)              ||                 \
    ((x) == ETH_DMA_ARBITRATION_FIXED_RX_PRIOR_TX)          ||                 \
    ((x) == ETH_DMA_ARBITRATION_FIXED_TX_PRIOR_RX))

#define IS_ETH_DMA_DROP_CHECKSUM_ERR_FRAME(x)                                  \
(   ((x) == ETH_DMA_DROP_CHECKSUM_ERR_FRAME_DISABLE)        ||                 \
    ((x) == ETH_DMA_DROP_CHECKSUM_ERR_FRAME_ENABLE))

#define IS_ETH_DMA_RX_STORE_FORWARD(x)                                         \
(   ((x) == ETH_DMA_RX_STORE_FORWARD_DISABLE)               ||                 \
    ((x) == ETH_DMA_RX_STORE_FORWARD_ENABLE))

