RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
#define IS_ETH_DMA_FLUSH_RX_FRAME(x)                                           \
(   ((x) == ETH_DMA_FLUSH_RX_FRAME_DISABLE)                 ||                 \
    ((x) == ETH_DMA_FLUSH_RX_FRAME_ENABLE))

#define IS_ETH_DMA_TRANS_STORE_FORWARD(x)                                      \
(   ((x) == ETH_DMA_TRANS_STORE_FORWARD_DISABLE)            ||                 \
    ((x) == ETH_DMA_TRANS_STORE_FORWARD_ENABLE))

#define IS_ETH_DMA_TRANS_THRESHOLD(x)                                          \
(   ((x) == ETH_DMA_TRANS_THRESHOLD_64BYTE)                 ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_128BYTE)                ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_192BYTE)                ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_256BYTE)                ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_40BYTE)                 ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_32BYTE)                 ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_24BYTE)                 ||                 \
    ((x) == ETH_DMA_TRANS_THRESHOLD_16BYTE))

#define IS_ETH_DMA_FORWARD_ERR_FRAME(x)                                        \
(   ((x) == ETH_DMA_FORWARD_ERR_FRAME_DISABLE)              ||                 \
    ((x) == ETH_DMA_FORWARD_ERR_FRAME_ENABLE))

#define IS_ETH_DMA_FORWARD_UNDERSIZE_FRAME(x)                                  \
(   ((x) == ETH_DMA_FORWARD_UNDERSIZE_FRAME_DISABLE)        ||                 \
    ((x) == ETH_DMA_FORWARD_UNDERSIZE_FRAME_ENABLE))

#define IS_ETH_DMA_DROP_JUMBO_FRAME(x)                                         \
(   ((x) == ETH_DMA_DROP_JUMBO_FRAME_DISABLE)               ||                 \
    ((x) == ETH_DMA_DROP_JUMBO_FRAME_ENABLE))

#define IS_ETH_DMA_RX_THRESHOLD(x)                                             \
(   ((x) == ETH_DMA_RX_THRESHOLD_64BYTE)                    ||                 \
    ((x) == ETH_DMA_RX_THRESHOLD_32BYTE)                    ||                 \
    ((x) == ETH_DMA_RX_THRESHOLD_96BYTE)                    ||                 \
    ((x) == ETH_DMA_RX_THRESHOLD_128BYTE))

#define IS_ETH_DMA_SEC_FRAME_OPERA(x)                                          \
(   ((x) == ETH_DMA_SEC_FRAME_OPERA_DISABLE)                ||                 \
    ((x) == ETH_DMA_SEC_FRAME_OPERA_ENABLE))

#define IS_ETH_DMA_FLAG(x)                                                     \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_DMA_FLAG_ALL) == ETH_DMA_FLAG_ALL))

#define IS_ETH_DMA_CLR_FLAG(x)                                                 \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_DMA_FLAG_CLR_ALL) == ETH_DMA_FLAG_CLR_ALL))

#define IS_ETH_DMA_INT(x)                                                      \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_DMA_INT_ALL) == ETH_DMA_INT_ALL))

#define IS_ETH_DMA_MISS_FRAME_TYPE(x)                                          \
(   ((x) == ETH_DMA_OVF_RXFIFO_CNT)                         ||                 \
    ((x) == ETH_DMA_OVF_MISS_FRAME_CNT))

#define IS_ETH_DMA_DESC_OWN(x)                                                 \
(   ((x) == ETH_DMA_DESC_OWN_CPU)                           ||                 \
    ((x) == ETH_DMA_DESC_OWN_DMA))

#define IS_ETH_DMA_DESC_BUF(x)                                                 \
(   ((x) == ETH_DMA_DESC_BUF1)                              ||                 \
    ((x) == ETH_DMA_DESC_BUF2))

#define IS_ETH_DMA_TXDESC_BUF_SIZE(x)                       ((x) <= 0x1FFFFFFFUL)

#define IS_ETH_DMA_TXDESC_CHECKSUM_CTRL(x)                                     \
(   ((x) == ETH_DMA_TXDESC_CHECKSUM_BYPASS)                 ||                 \
    ((x) == ETH_DMA_TXDESC_CHECKSUM_IPV4_HEADER)            ||                 \
    ((x) == ETH_DMA_TXDESC_CHECKSUM_TCPUDPICMP_SEGMENT)     ||                 \
    ((x) == ETH_DMA_TXDESC_CHECKSUM_TCPUDPICMP_FULL))

#define IS_ETH_DMA_TXDESC_VLAN_CTRL(x)                                         \
(   ((x) == ETH_DMA_TXDESC_VLAN_BYPASS)                     ||                 \
    ((x) == ETH_DMA_TXDESC_VLAN_REMOVE_TAG)                 ||                 \
    ((x) == ETH_DMA_TXDESC_VLAN_INSERT_TAG)                 ||                 \
    ((x) == ETH_DMA_TXDESC_VLAN_REPLACE_TAG))

#define IS_ETH_DMA_TXDESC_SRC_ADDR_CTRL(x)                                     \
(   ((x) == ETH_DMA_TXDESC_SRC_ADDR_BYPASS)                 ||                 \
    ((x) == ETH_DMA_TXDESC_SRC_ADDR_INSTER_MACADDR0)        ||                 \
    ((x) == ETH_DMA_TXDESC_SRC_ADDR_REPLACE_MACADDR0)       ||                 \
    ((x) == ETH_DMA_TXDESC_SRC_ADDR_INSTER_MACADDR1)        ||                 \
    ((x) == ETH_DMA_TXDESC_SRC_ADDR_REPLACE_MACADDR1))

#define IS_ETH_PMT_FLAG(x)                                                     \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_PMT_FLAG_ALL) == ETH_PMT_FLAG_ALL))

#define IS_ETH_PMT_WAKEUP_SRC(x)                                               \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_PMT_WAKEUP_SRC_ALL) == ETH_PMT_WAKEUP_SRC_ALL))

#define IS_ETH_MMC_CNT_PRESET_MD(x)                                            \
(   ((x) == ETH_MMC_CNT_PRESET_MD_DISABLE)                  ||                 \
    ((x) == ETH_MMC_CNT_PRESET_MD_HALF_VALUE)               ||                 \
    ((x) == ETH_MMC_CNT_PRESET_MD_FULL_VALUE))

#define IS_ETH_MMC_RD_RST(x)                                                   \
(   ((x) == ETH_MMC_RD_RST_DISABLE)                         ||                 \
    ((x) == ETH_MMC_RD_RST_ENABLE))

#define IS_ETH_MMC_CNT_RELOAD(x)                                               \
(   ((x) == ETH_MMC_CNT_RELOAD_DISABLE)                     ||                 \
    ((x) == ETH_MMC_CNT_RELOAD_ENABLE))

