RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
#define IS_ETH_MMC_TX_FLAG(x)                                                  \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_MMC_FLAG_TX_ALL) == ETH_MMC_FLAG_TX_ALL))

#define IS_ETH_MMC_RX_FLAG(x)                                                  \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_MMC_FLAG_RX_ALL) == ETH_MMC_FLAG_RX_ALL))

#define IS_ETH_MMC_TX_INT(x)                                                   \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_MMC_INT_TX_ALL) == ETH_MMC_INT_TX_ALL))

#define IS_ETH_MMC_RX_INT(x)                                                   \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_MMC_INT_RX_ALL) == ETH_MMC_INT_RX_ALL))

#define IS_ETH_MMC_REG(x)                                                      \
(   ((x) == ETH_MMC_REG_TXBRGFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXMUGFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXDEEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXLCEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXECEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXCAEFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXUNGFR)                            ||                 \
    ((x) == ETH_MMC_REG_TXEDEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXBRGFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXMUGFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXCREFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXALEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXRUEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXUNGFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXLEEFR)                            ||                 \
    ((x) == ETH_MMC_REG_RXOREFR))

#define IS_ETH_PTP_DEST_ADDR_FILTER(x)                                         \
(   ((x) == ETH_PTP_DEST_ADDR_FILTER_DISABLE)               ||                 \
    ((x) == ETH_PTP_DEST_ADDR_FILTER_ENABLE))

#define IS_ETH_PTP_DATAGRAM_TYPE(x)                                            \
(   ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY)        ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC)                     ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_DELAY)                    ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY_PDELAY) ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_PDELAY)              ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_DELAY_PDEALY)             ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_SYNC_DELAY)               ||                 \
    ((x) == ETH_PTP_DATAGRAM_TYPE_PDELAY))

#define IS_ETH_PTP_FRAME_TYPE(x)                                               \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_PTP_FRAME_TYPE_ALL) == ETH_PTP_FRAME_TYPE_ALL))

#define IS_ETH_PTP_DATAGRAM_VER(x)                                             \
(   ((x) == ETH_PTP_DATAGRAM_VER_IEEE1588V1)                ||                 \
    ((x) == ETH_PTP_DATAGRAM_VER_IEEE1588V2))

#define IS_ETH_PTP_SUBSEC_SCALE(x)                                             \
(   ((x) == ETH_PTP_SUBSEC_SCALE_HEX)                       ||                 \
    ((x) == ETH_PTP_SUBSEC_SCALE_DEC))

#define IS_ETH_PTP_CALIB_MD(x)                                                 \
(   ((x) == ETH_PTP_CALIB_MD_COARSE)                        ||                 \
    ((x) == ETH_PTP_CALIB_MD_FINE))

#define IS_ETH_PTP_TIME_UPDATE_SIGN(x)                                         \
(   ((x) == ETH_PTP_TIME_UPDATE_SIGN_MINUS)                 ||                 \
    ((x) == ETH_PTP_TIME_UPDATE_SIGN_PLUS))

#define IS_ETH_PTP_FLAG(x)                                                     \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_PTP_FLAG_ALL) == ETH_PTP_FLAG_ALL))

#define IS_ETH_PPS_CH(x)                                                       \
(   ((x) == ETH_PPS_CH0)                                    ||                 \
    ((x) == ETH_PPS_CH1))

#define IS_ETH_PPS_TRIG_FUNC(x)                                                \
(   ((x) == ETH_PPS_TRIG_FUNC_INT_EVT)                      ||                 \
    ((x) == ETH_PPS_TRIG_FUNC_INT_PPS_EVT)                  ||                 \
    ((x) == ETH_PPS_TRIG_FUNC_PPS_EVT))

#define IS_ETH_PPS_OUTPUT_MD(x)                                                \
(   ((x) == ETH_PPS_OUTPUT_MD_CONTINUE)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_MD_ONCE))

#define IS_ETH_PPS_OUTPUT_FREQ(x)                                              \
(   ((x) == ETH_PPS_OUTPUT_FREQ_1HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_2HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_4HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_8HZ)                        ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_16HZ)                       ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_32HZ)                       ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_64HZ)                       ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_128HZ)                      ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_256HZ)                      ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_512HZ)                      ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_1024HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_2048HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_4096HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_8192HZ)                     ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_16384HZ)                    ||                 \
    ((x) == ETH_PPS_OUTPUT_FREQ_32768HZ)                    ||                 \
    ((x) == ETH_PPS_OUTPUT_ONE_PULSE))

#define IS_ETH_PPS1_COMPLEX_FUNC(ch, mode, freq)                               \
(   ((ch)    == ETH_PPS_CH0)                                ||                 \
    (((mode) == ETH_PPS_OUTPUT_MD_CONTINUE)                 &&                 \
    ((freq)  == ETH_PPS_OUTPUT_ONE_PULSE)))

