RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
#define IS_ETH_PTP_SUB_SEC(x)                               ((x) <= 0x7FFFFFFFUL)

#define IS_ETH_DMA_TXDESC_STATUS(x)                                            \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_DMA_TXDESC_STATUS_ALL) == ETH_DMA_TXDESC_STATUS_ALL))

#define IS_ETH_DMA_RXDESC_STATUS(x)                                             \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_DMA_RXDESC_STATUS_ALL) == ETH_DMA_RXDESC_STATUS_ALL))

#define IS_ETH_DMA_RXDESC_EXTEND_STATUS(x)                                     \
(   ((x) != 0U)                                             &&                 \
    (((x) | ETH_DMA_RXDESC_EXTEND_STATUS_ALL) ==                               \
    ETH_DMA_RXDESC_EXTEND_STATUS_ALL))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ETH_Global_Functions ETH Global Functions
 * @{
 */

/**
 * @brief  De-Initialize ETH.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: De-Initialize success
 *           - LL_ERR_TIMEOUT: De-Initialize timeout
 */
int32_t ETH_DeInit(void)
{
    int32_t i32Ret;

    ETH_MAC_DeInit();
    ETH_DMA_DeInit();
    ETH_MACADDR_DeInit(ETH_MAC_ADDR_IDX0);
    ETH_MACADDR_DeInit(ETH_MAC_ADDR_IDX1);
    ETH_MACADDR_DeInit(ETH_MAC_ADDR_IDX2);
    ETH_MACADDR_DeInit(ETH_MAC_ADDR_IDX3);
    ETH_MACADDR_DeInit(ETH_MAC_ADDR_IDX4);
    ETH_MAC_L3L4FilterDeInit();
    ETH_PTP_DeInit();
    ETH_PPS_DeInit(ETH_PPS_CH0);
    ETH_PPS_DeInit(ETH_PPS_CH1);
    i32Ret = ETH_MMC_DeInit();
    if (LL_OK == i32Ret) {
        i32Ret = ETH_DMA_SoftwareReset();
    }

    return i32Ret;
}

/**
 * @brief  Initialize ETH.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] pstcEthInit             Pointer to a @ref stc_eth_init_t structure
 * @retval int32_t:
 *           - LL_OK: ETH Initialize success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL or pstcEthInit == NULL or PHY Address error
 *           - LL_ERR_TIMEOUT: Initialize timeout
 */
int32_t ETH_Init(stc_eth_handle_t *pstcEthHandle, stc_eth_init_t *pstcEthInit)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;
    uint32_t u32TempReg;
    uint32_t u32BusClk;
    uint32_t u32PhyTimeout;
    uint16_t u16PhyReg = 0U;

    if ((NULL == pstcEthHandle) || (NULL == pstcEthInit)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_AUTO_NEGO(pstcEthHandle->stcCommInit.u16AutoNego));
        DDL_ASSERT(IS_ETH_MAC_CHECKSUM_MD(pstcEthHandle->stcCommInit.u32ChecksumMode));
        DDL_ASSERT(IS_ETH_RX_MD(pstcEthHandle->stcCommInit.u32ReceiveMode));
        DDL_ASSERT(IS_ETH_MAC_IF(pstcEthHandle->stcCommInit.u32Interface));

        /* Select MII or RMII Mode*/
        MODIFY_REG32(CM_ETH->MAC_IFCONFR, ETH_MAC_IFCONFR_IFSEL, pstcEthHandle->stcCommInit.u32Interface);
        /* ETH software reset */
        if (LL_OK != ETH_DMA_SoftwareReset()) {
            i32Ret = LL_ERR_TIMEOUT;
        } else {
            /* Get ETH frequency value */
            u32BusClk = SystemCoreClock / (0x01UL << (READ_REG32_BIT(CM_CMU->SCFGR,
                                           CMU_SCFGR_PCLK1S) >> CMU_SCFGR_PCLK1S_POS));
            /* Set SMIC bits depending on PCLK1 clock value */
            /* PCLK1 Clock Range between 20-35 MHz */
            if ((u32BusClk >= 20000000UL) && (u32BusClk < 35000000UL)) {
                u32TempReg = ETH_MAC_SMIADDR_SMIC_1;
            } else if ((u32BusClk >= 35000000UL) && (u32BusClk < 60000000UL)) {     /* PCLK1 Clock Range between 35-60 MHz */
                u32TempReg = ETH_MAC_SMIADDR_SMIC_1 | ETH_MAC_SMIADDR_SMIC_0;
            } else if ((u32BusClk >= 60000000UL) && (u32BusClk < 100000000UL)) {    /* PCLK1 Clock Range between 60-100 MHz */
                u32TempReg = 0UL;
            } else {    /* PCLK1 Clock Range between 100-120 MHz */
                u32TempReg = ETH_MAC_SMIADDR_SMIC_0;
            }
            /* Configure the ETH MDC Clock Range */
            MODIFY_REG32(CM_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_SMIC, u32TempReg);

            /* PHY initialization and configuration */
            /* Reset the PHY */
            if (LL_OK != (ETH_PHY_WriteReg(pstcEthHandle, PHY_BCR, PHY_SOFT_RESET))) {
                i32Ret = LL_ERR_TIMEOUT;
            } else {
                /* Delay to assure PHY reset */
                DDL_DelayMS(ETH_PHY_RST_DELAY);
                if (ETH_AUTO_NEGO_DISABLE != pstcEthHandle->stcCommInit.u16AutoNego) {
                    u32PhyTimeout = ETH_PHY_RD_TIMEOUT * (HCLK_VALUE / 20000UL);
                    /* Wait for linke status */
                    u32Count = ETH_LINK_STATUS_TIMEOUT * (HCLK_VALUE / 20000UL);
                    while (PHY_LINK_STATUS != (u16PhyReg & PHY_LINK_STATUS)) {
                        if (0UL == u32Count) {
                            break;
                        }
                        if (LL_ERR_TIMEOUT == ETH_PHY_ReadReg(pstcEthHandle, PHY_BSR, &u16PhyReg)) {
                            u32Count = (u32Count > u32PhyTimeout) ? (u32Count - u32PhyTimeout) : 0UL;
                        } else {
                            u32Count = (u32Count > u32PhyTimeout) ? (u32Count - (u32PhyTimeout / 150U)) : 0UL;
                        }
                    }

                    if ((0x0000U == u16PhyReg) || (0xFFFFU == u16PhyReg)) {
                        i32Ret = LL_ERR_INVD_PARAM;
                    } else if (PHY_LINK_STATUS != (u16PhyReg & PHY_LINK_STATUS)) {
                        i32Ret = LL_ERR_TIMEOUT;
                    } else {
                        /* Enable Auto-Negotiation */
                        if (LL_OK != (ETH_PHY_WriteReg(pstcEthHandle, PHY_BCR, PHY_AUTONEGOTIATION))) {
                            i32Ret = LL_ERR_TIMEOUT;
                        } else {
                            /* Wait until the auto-negotiation will be completed */
                            u32Count = ETH_AUTO_NEGO_CPLT_TIMEOUT * (HCLK_VALUE / 20000UL);
                            while (PHY_AUTONEGO_COMPLETE != (u16PhyReg & PHY_AUTONEGO_COMPLETE)) {
                                if (0UL == u32Count) {
                                    break;
                                }
                                if (LL_ERR_TIMEOUT == ETH_PHY_ReadReg(pstcEthHandle, PHY_BSR, &u16PhyReg)) {
                                    u32Count = (u32Count > u32PhyTimeout) ? (u32Count - u32PhyTimeout) : 0UL;
                                } else {
                                    u32Count = (u32Count > u32PhyTimeout) ? (u32Count - (u32PhyTimeout / 150U)) : 0UL;
                                }
                            }

                            if (PHY_AUTONEGO_COMPLETE != (u16PhyReg & PHY_AUTONEGO_COMPLETE)) {
                                i32Ret = LL_ERR_TIMEOUT;
                            } else {
                                /* Read the result of the auto-negotiation */
                                /* Configure ETH duplex mode according to the result of automatic negotiation */
                                if (0U != (u16PhyReg & (uint16_t)(PHY_100BASE_TX_FD | PHY_10BASE_T_FD))) {
                                    pstcEthHandle->stcCommInit.u32DuplexMode = ETH_MAC_DUPLEX_MD_FULL;
                                } else {
                                    pstcEthHandle->stcCommInit.u32DuplexMode = ETH_MAC_DUPLEX_MD_HALF;
                                }
                                /* Configure ETH speed according to the result of automatic negotiation */
                                if (0U != (u16PhyReg & (uint16_t)(PHY_100BASE_TX_FD | PHY_100BASE_TX_HD))) {
                                    pstcEthHandle->stcCommInit.u32Speed = ETH_MAC_SPEED_100M;
                                } else {
                                    pstcEthHandle->stcCommInit.u32Speed = ETH_MAC_SPEED_10M;
                                }
                            }
                        }
                    }
                } else {    /* AutoNegotiation Disable */
                    DDL_ASSERT(IS_ETH_MAC_SPEED(pstcEthHandle->stcCommInit.u32Speed));
                    DDL_ASSERT(IS_ETH_MAC_DUPLEX_MD(pstcEthHandle->stcCommInit.u32DuplexMode));

