RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
                    if (LL_OK != ETH_PHY_WriteReg(pstcEthHandle, PHY_BCR,
                                                  ((uint16_t)(pstcEthHandle->stcCommInit.u32DuplexMode >> 3U) |
                                                   (uint16_t)(pstcEthHandle->stcCommInit.u32Speed >> 1U)))) {
                        i32Ret = LL_ERR_TIMEOUT;
                    } else {
                        /* Delay to assure PHY configuration */
                        DDL_DelayMS(ETH_PHY_CONFIG_DELAY);
                    }
                }
            }

            /* Auto-negotiation failed */
            if (LL_OK != i32Ret) {
                pstcEthHandle->stcCommInit.u32DuplexMode = ETH_MAC_DUPLEX_MD_FULL;
                pstcEthHandle->stcCommInit.u32Speed      = ETH_MAC_SPEED_100M;
            }
            /* Config checksum offload */
            if (ETH_MAC_CHECKSUM_MD_HW == pstcEthHandle->stcCommInit.u32ChecksumMode) {
                pstcEthInit->stcMacInit.u32ChecksumOffload = ETH_MAC_CHECKSUM_OFFLOAD_ENABLE;
            } else {
                pstcEthInit->stcMacInit.u32ChecksumOffload = ETH_MAC_CHECKSUM_OFFLOAD_DISABLE;
            }

            /* Config MAC,DMA,MMC and PTP */
            (void)ETH_MAC_Init(pstcEthHandle, &pstcEthInit->stcMacInit);
            (void)ETH_DMA_Init(&pstcEthInit->stcDmaInit);
            /* Mask all MMC interrupts */
            ETH_MMC_TxIntCmd(ETH_MMC_INT_TX_ALL, DISABLE);
            ETH_MMC_RxIntCmd(ETH_MMC_INT_RX_ALL, DISABLE);
            /* Enable the ETH Rx Interrupt */
            if (ETH_RX_MD_INT == pstcEthHandle->stcCommInit.u32ReceiveMode) {
                ETH_DMA_IntCmd(ETH_DMA_INT_NIE | ETH_DMA_INT_RIE, ENABLE);
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_comm_init_t to default values.
 * @param  [out] pstcCommInit           Pointer to a @ref stc_eth_comm_init_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcCommInit == NULL
 */
int32_t ETH_CommStructInit(stc_eth_comm_init_t *pstcCommInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcCommInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcCommInit->u16AutoNego       = ETH_AUTO_NEGO_ENABLE;
        pstcCommInit->u16PhyAddr        = ETH_PHY_ADDR;
        pstcCommInit->au8MacAddr[0]     = ETH_MAC_ADDR0;
        pstcCommInit->au8MacAddr[1]     = ETH_MAC_ADDR1;
        pstcCommInit->au8MacAddr[2]     = ETH_MAC_ADDR2;
        pstcCommInit->au8MacAddr[3]     = ETH_MAC_ADDR3;
        pstcCommInit->au8MacAddr[4]     = ETH_MAC_ADDR4;
        pstcCommInit->au8MacAddr[5]     = ETH_MAC_ADDR5;
        pstcCommInit->u32Interface      = ETH_MAC_IF_MII;
        pstcCommInit->u32Speed          = ETH_MAC_SPEED_100M;
        pstcCommInit->u32DuplexMode     = ETH_MAC_DUPLEX_MD_FULL;
        pstcCommInit->u32ChecksumMode   = ETH_MAC_CHECKSUM_MD_HW;
        pstcCommInit->u32ReceiveMode    = ETH_RX_MD_POLLING;
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_init_t to default values.
 * @param  [out] pstcEthInit            Pointer to a @ref stc_eth_init_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcEthInit == NULL
 */
int32_t ETH_StructInit(stc_eth_init_t *pstcEthInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcEthInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        (void)ETH_MAC_StructInit(&pstcEthInit->stcMacInit);
        (void)ETH_DMA_StructInit(&pstcEthInit->stcDmaInit);
    }

    return i32Ret;
}

/**
 * @brief  Enable MAC and DMA Transmission/Reception
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Enable success
 *           - LL_ERR_TIMEOUT: Enable timeout
 */
int32_t ETH_Start(void)
{
    int32_t i32Ret;

    /* Flush Transmit FIFO */
    i32Ret = ETH_DMA_FlushTransFIFO();
    if (LL_OK == i32Ret) {
        /* Enable MAC Transmit */
        ETH_MAC_TransCmd(ENABLE);
        /* Enable MAC Receive */
        ETH_MAC_ReceiveCmd(ENABLE);
        /* Enable DMA Transmit */
        ETH_DMA_TransCmd(ENABLE);
        /* Enable DMA Receive */
        ETH_DMA_ReceiveCmd(ENABLE);
    }

    return i32Ret;
}

/**
 * @brief  Disable MAC and DMA Transmission/Reception
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Disable success
 *           - LL_ERR_TIMEOUT: Disable timeout
 */
int32_t ETH_Stop(void)
{
    int32_t i32Ret;

    /* Disable DMA Transmit */
    ETH_DMA_TransCmd(DISABLE);
    /* Disable DMA Receive */
    ETH_DMA_ReceiveCmd(DISABLE);
    /* Disable MAC Receive */
    ETH_MAC_ReceiveCmd(DISABLE);
    /* Disable MAC Transmit */
    ETH_MAC_TransCmd(DISABLE);
    /* Flush Transmit FIFO */
    i32Ret = ETH_DMA_FlushTransFIFO();

    return i32Ret;
}

/******************************************************************************/
/*                             PHY Functions                                  */
/******************************************************************************/
/**
 * @brief  Write PHY register
 * @note   More PHY register could be written depending on the used PHY.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] u16Reg                  PHY register address
 *         This parameter can be one of the following values:
 *           @arg PHY_BCR:              PHY Basic Control Register
 *           @arg other value:          The value range from 1 to 31
 * @param  [in] u16Value                PHY register value
 * @retval int32_t:
 *           - LL_OK: Write register success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL
 *           - LL_ERR_TIMEOUT: Write timeout
 */
int32_t ETH_PHY_WriteReg(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t u16Value)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    if (NULL == pstcEthHandle) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PHY_ADDR(pstcEthHandle->stcCommInit.u16PhyAddr));
        DDL_ASSERT(IS_ETH_PHY_REG(u16Reg));

        /* Set the MAC_SMIDATR register */
        WRITE_REG32(CM_ETH->MAC_SMIDATR, u16Value);
        /* Set the MAC_SMIADDR register */
        /* Keep only the MDC Clock Range SMIC[3:0] bits value */
        MODIFY_REG32(CM_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_CLR_MASK,
                     (((uint32_t)(pstcEthHandle->stcCommInit.u16PhyAddr) << ETH_MAC_SMIADDR_SMIA_POS) |
                      ((uint32_t)u16Reg << ETH_MAC_SMIADDR_SMIR_POS) | ETH_MAC_SMIADDR_SMIW | ETH_MAC_SMIADDR_SMIB));
        /* Check for the Busy flag */
        u32Count = ETH_PHY_WR_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32_BIT(CM_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_SMIB)) {
            if (0UL == u32Count) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
            u32Count--;
        }
    }

    return i32Ret;
}

/**
 * @brief  Read PHY register.
 * @note   More PHY register could be read depending on the used PHY.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] u16Reg                  PHY register address
 *         This parameter can be one of the following values:
 *           @arg PHY_BCR:              PHY Basic Control Register
 *           @arg PHY_BSR:              PHY Basic Status Register
 *           @arg other value:          The value range from 2 to 31
 * @param  [out] pu16Value              Pointer to PHY register value
 * @retval int32_t:
 *           - LL_OK: Read register success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL or pu16Value == NULL
 *           - LL_ERR_TIMEOUT: Read timeout
 */
int32_t ETH_PHY_ReadReg(stc_eth_handle_t *pstcEthHandle, uint16_t u16Reg, uint16_t *pu16Value)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcEthHandle) || (NULL == pu16Value)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PHY_ADDR(pstcEthHandle->stcCommInit.u16PhyAddr));
        DDL_ASSERT(IS_ETH_PHY_REG(u16Reg));

        *pu16Value = 0U;
        /* Set the MAC_SMIADDR register */
        /* Keep only the MDC Clock Range SMIC[3:0] bits value */
        MODIFY_REG32(CM_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_CLR_MASK,
                     (((uint32_t)(pstcEthHandle->stcCommInit.u16PhyAddr) << ETH_MAC_SMIADDR_SMIA_POS) |
                      ((uint32_t)u16Reg << ETH_MAC_SMIADDR_SMIR_POS) | ETH_MAC_SMIADDR_SMIB));
        /* Check for the Busy flag */
        u32Count = ETH_PHY_RD_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32_BIT(CM_ETH->MAC_SMIADDR, ETH_MAC_SMIADDR_SMIB)) {
            if (0UL == u32Count) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
            u32Count--;
        }
        if (LL_ERR_TIMEOUT != i32Ret) {
            /* Get the MAC_SMIDATR value */
            *pu16Value = (uint16_t)(READ_REG32(CM_ETH->MAC_SMIDATR));
        }
    }

    return i32Ret;
}

/**
 * @brief  Enabele or disable PHY loopback.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Set loopback success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL
 *           - LL_ERR: Communication error
 */
int32_t ETH_PHY_LoopBackCmd(stc_eth_handle_t *pstcEthHandle, en_functional_state_t enNewState)
{
    int32_t i32Ret;
    uint16_t u16Value;

    if (NULL == pstcEthHandle) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PHY_ADDR(pstcEthHandle->stcCommInit.u16PhyAddr));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

