RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    if (NULL == pstcMacInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcMacInit->u32TxClockPolarity     = ETH_MAC_TX_CLK_POLARITY_KEEP;
        pstcMacInit->u32RxClockPolarity     = ETH_MAC_RX_CLK_POLARITY_KEEP;
        pstcMacInit->u32SrcAddrMode         = ETH_MAC_TXVLAN_MD_BY_DMA_TXDESC;
        pstcMacInit->u32TypeFrameStripFCS   = ETH_MAC_TYPE_FRAME_STRIP_FCS_DISABLE;
        pstcMacInit->u32Watchdog            = ETH_MAC_WATCHDOG_ENABLE;
        pstcMacInit->u32Jabber              = ETH_MAC_JABBER_ENABLE;
        pstcMacInit->u32InterframeGap       = ETH_MAC_INTERFRAME_GAP_96BIT;
        pstcMacInit->u32CarrierSense        = ETH_MAC_CARRIER_SENSE_ENABLE;
        pstcMacInit->u32ReceiveOwn          = ETH_MAC_RX_OWN_ENABLE;
        pstcMacInit->u32ChecksumOffload     = ETH_MAC_CHECKSUM_OFFLOAD_DISABLE;
        pstcMacInit->u32RetryTrans          = ETH_MAC_RETRY_TRANS_DISABLE;
        pstcMacInit->u32AutoStripPadFCS     = ETH_MAC_AUTO_STRIP_PAD_FCS_DISABLE;
        pstcMacInit->u32BackOffLimit        = ETH_MAC_BACKOFF_LIMIT10;
        pstcMacInit->u32DeferralCheck       = ETH_MAC_DEFERRAL_CHECK_DISABLE;
        pstcMacInit->u16PauseTime           = 0U;
        pstcMacInit->u32ZeroQuantaPause     = ETH_MAC_ZERO_QUANTA_PAUSE_DISABLE;
        pstcMacInit->u32PauseLowThreshold   = ETH_MAC_PAUSE_LOW_THRESHOLD_MINUS4;
        pstcMacInit->u32UnicastPauseFrame   = ETH_MAC_UNICAST_PAUSE_FRAME_DETECT_DISABLE;
        pstcMacInit->u32ReceiveFlowControl  = ETH_MAC_RX_FLOW_CTRL_DISABLE;
        pstcMacInit->u32TransFlowControl    = ETH_MAC_TRANS_FLOW_CTRL_DISABLE;
        pstcMacInit->u32ReceiveAll          = ETH_MAC_RX_ALL_DISABLE;
        pstcMacInit->u32DropNotTcpUdp       = ETH_MAC_DROP_NOT_TCPUDP_DISABLE;

        pstcMacInit->u32VlanTagFilter           = ETH_MAC_VLAN_TAG_FILTER_DISABLE;
        pstcMacInit->u32SrcAddrFilter           = ETH_MAC_SRC_ADDR_FILTER_DISABLE;
        pstcMacInit->u32PassControlFrame        = ETH_MAC_PASS_CTRL_FRAME_FORWARD_NOT_PAUSE;
        pstcMacInit->u32BroadcastFrame          = ETH_MAC_RX_BROADCAST_FRAME_ENABLE;
        pstcMacInit->u32DestAddrFilter          = ETH_MAC_DEST_ADDR_FILTER_NORMAL;
        pstcMacInit->u32MulticastFrameFilter    = ETH_MAC_MULTICAST_FRAME_FILTER_PERFECT;
        pstcMacInit->u32UnicastFrameFilter      = ETH_MAC_UNICAST_FRAME_FILTER_PERFECT;
        pstcMacInit->u32PromiscuousMode         = ETH_MAC_PROMISCUOUS_MD_DISABLE;
        pstcMacInit->u32HashTableHigh           = 0UL;
        pstcMacInit->u32HashTableLow            = 0UL;
        pstcMacInit->u32TxVlanMode              = ETH_MAC_TXVLAN_MD_BYPASS;
        pstcMacInit->u16TxVlanTag               = 0U;
        pstcMacInit->u32RxVlanFilter            = ETH_MAC_RXVLAN_FILTER_NORMAL;
        pstcMacInit->u32RxVlanCompare           = ETH_MAC_RXVLAN_CMP_16BIT;
        pstcMacInit->u16RxVlanTag               = 0U;
        pstcMacInit->u16RxVlanHashTable         = 0U;
    }

    return i32Ret;
}

/**
 * @brief  Set MAC duplex mode and speed.
 * @param  [in] u32Mode                 MAC duplex mode
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_DUPLEX_MD_HALF:   Half duplex mode
 *           @arg ETH_MAC_DUPLEX_MD_FULL:   Full duplex mode
 * @param  [in] u32Speed                MAC speed
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_SPEED_10M:    10Mbps
 *           @arg ETH_MAC_SPEED_100M:   100Mbps
 * @retval None
 */
void ETH_MAC_SetDuplexSpeed(uint32_t u32Mode, uint32_t u32Speed)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_DUPLEX_MD(u32Mode));
    DDL_ASSERT(IS_ETH_MAC_SPEED(u32Speed));

    MODIFY_REG32(CM_ETH->MAC_CONFIGR, (ETH_MAC_CONFIGR_FES | ETH_MAC_CONFIGR_DM), (u32Mode | u32Speed));
}

/**
 * @brief  Set MAC hash table.
 * @param  [in] u32HashHigh             Hash table high value.
 * @param  [in] u32HashLow              Hash table low value.
 * @retval None
 */
void ETH_MAC_SetHashTable(uint32_t u32HashHigh, uint32_t u32HashLow)
{
    WRITE_REG32(CM_ETH->MAC_HASHTLR, u32HashLow);
    WRITE_REG32(CM_ETH->MAC_HASHTHR, u32HashHigh);
}

/**
 * @brief  Set MAC Tx VLAN tag value.
 * @param  [in] u16TxTag                The tag value of Tx VLAN.
 * @retval None
 */
void ETH_MAC_SetTxVlanTagValue(uint16_t u16TxTag)
{
    MODIFY_REG32(CM_ETH->MAC_VTACTLR, ETH_MAC_VTACTLR_VLANV, u16TxTag);
}

/**
 * @brief  Set MAC Rx VLAN tag value.
 * @param  [in] u16RxTag                The tag value of Rx VLAN.
 * @retval None
 */
void ETH_MAC_SetRxVlanTagValue(uint16_t u16RxTag)
{
    MODIFY_REG32(CM_ETH->MAC_VTAFLTR, ETH_MAC_VTAFLTR_VLFLT, u16RxTag);
}

/**
 * @brief  Set MAC Rx VLAN hash table.
 * @param  [in] u16HashValue            The value of Rx VLAN hash table.
 * @retval None
 */
void ETH_MAC_SetRxVlanHashTable(uint16_t u16HashValue)
{
    WRITE_REG32(CM_ETH->MAC_VLAHTBR, u16HashValue);
}

/**
 * @brief  Enable or disable MAC loopback.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MAC_LoopBackCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->MAC_CONFIGR_b.LM, enNewState);
}

/**
 * @brief  Enable or disable MAC Back Pressure.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MAC_BackPressureCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->MAC_FLOCTLR_b.FCA_BPA, enNewState);
}

/**
 * @brief  Enable or disable MAC Transmit.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MAC_TransCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->MAC_CONFIGR_b.TE, enNewState);
}

/**
 * @brief  Enable or disable MAC Receive.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MAC_ReceiveCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

