RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    WRITE_REG32(bCM_ETH->MAC_CONFIGR_b.RE, enNewState);
}

/**
 * @brief  Enable or disable MAC interrupt.
 * @param  [in] u32IntType              MAC interrupt source type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_INT_TSPIM:    Time stamp trigger interrupt (on MAC)
 *           @arg ETH_MAC_INT_PMTIM:    PMT interrupt (on MAC)
 *           @arg ETH_MAC_INT_ALL:      All of the above
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MAC_IntCmd(uint32_t u32IntType, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        CLR_REG32_BIT(CM_ETH->MAC_INTMSKR, u32IntType);
    } else {
        SET_REG32_BIT(CM_ETH->MAC_INTMSKR, u32IntType);
    }
}

/**
 * @brief  Get MAC interrupt status.
 * @param  [in] u32Flag                 MAC interrupt flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MAC_INT_FLAG_TSPIS:   Time stamp trigger flag (on MAC)
 *           @arg ETH_MAC_INT_FLAG_MMCTXIS: MMC transmit flag
 *           @arg ETH_MAC_INT_FLAG_MMCRXIS: MMC receive flag
 *           @arg ETH_MAC_INT_FLAG_MMCIS:   MMC flag (on MAC)
 *           @arg ETH_MAC_INT_FLAG_PMTIS:   PMT flag (on MAC)
 *           @arg ETH_MAC_INT_FLAG_ALL:     All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_MAC_GetIntStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_INT_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->MAC_INTSTSR, u32Flag))) {
        enFlagSta = SET;
    }

    return enFlagSta;
}

/******************************************************************************/
/*                          MAC Address Functions                             */
/******************************************************************************/
/**
 * @brief  De-Initialize MAC Address.
 * @param  [in] u32Index                MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_IDX0:    MAC address 0
 *           @arg ETH_MAC_ADDR_IDX1:    MAC address 1
 *           @arg ETH_MAC_ADDR_IDX2:    MAC address 2
 *           @arg ETH_MAC_ADDR_IDX3:    MAC address 3
 *           @arg ETH_MAC_ADDR_IDX4:    MAC address 4
 * @retval None
 */
void ETH_MACADDR_DeInit(uint32_t u32Index)
{
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32MacHigh = 0x0000FFFFUL;

    DDL_ASSERT(IS_ETH_MAC_ADDR_NORMAL_INDEX(u32Index));

    MACADHR = ETH_MAC_MACADHR_ADDR(u32Index);
    MACADLR = ETH_MAC_MACADLR_ADDR(u32Index);
    if (ETH_MAC_ADDR_IDX0 == u32Index) {
        u32MacHigh |= 0x80000000UL;
    }
    WRITE_REG32(*MACADHR, u32MacHigh);
    WRITE_REG32(*MACADLR, 0xFFFFFFFFUL);
}

/**
 * @brief  Initialize MAC Address.
 * @param  [in] u32Index                MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_IDX0:    MAC address 0
 *           @arg ETH_MAC_ADDR_IDX1:    MAC address 1
 *           @arg ETH_MAC_ADDR_IDX2:    MAC address 2
 *           @arg ETH_MAC_ADDR_IDX3:    MAC address 3
 *           @arg ETH_MAC_ADDR_IDX4:    MAC address 4
 * @param  [in] pstcMacAddrInit         Pointer to a @ref stc_eth_mac_addr_config_t structure
 * @retval int32_t:
 *           - LL_OK: MAC Address Initialize success
 *           - LL_ERR_INVD_PARAM: pstcMacAddrInit == NULL
 */
int32_t ETH_MACADDR_Init(uint32_t u32Index, const stc_eth_mac_addr_config_t *pstcMacAddrInit)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32TempReg;
    uint32_t *pu32AddrLow;

    if (NULL == pstcMacAddrInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_ADDR_NORMAL_INDEX(u32Index));
        DDL_ASSERT(IS_ETH_MAC_ADDR_FILTER(pstcMacAddrInit->u32MacAddrFilter));
        DDL_ASSERT(IS_ETH_MAC_ADDR_MASK(pstcMacAddrInit->u32MacAddrMask));

        MACADHR = ETH_MAC_MACADHR_ADDR(u32Index);
        MACADLR = ETH_MAC_MACADLR_ADDR(u32Index);
        /* Set MAC address high register */
        u32TempReg = ((uint32_t)pstcMacAddrInit->au8MacAddr[5] << 8U) | (uint32_t)pstcMacAddrInit->au8MacAddr[4];
        if (ETH_MAC_ADDR_IDX0 != u32Index) {
            u32TempReg |= pstcMacAddrInit->u32MacAddrFilter | pstcMacAddrInit->u32MacAddrMask;
        }
        WRITE_REG32(*MACADHR, u32TempReg);
        /* Set MAC address low register */
        pu32AddrLow = (uint32_t *)((uint32_t) & (pstcMacAddrInit->au8MacAddr[0]));
        WRITE_REG32(*MACADLR, *pu32AddrLow);
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_mac_addr_config_t to default values.
 * @param  [out] pstcMacAddrInit        Pointer to a @ref stc_eth_mac_addr_config_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcMacAddrInit == NULL
 */
int32_t ETH_MACADDR_StructInit(stc_eth_mac_addr_config_t *pstcMacAddrInit)
{
    int32_t i32Ret = LL_OK;
    uint8_t i;

    if (NULL == pstcMacAddrInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcMacAddrInit->u32MacAddrFilter = ETH_MAC_ADDR_FILTER_DISABLE;
        pstcMacAddrInit->u32MacAddrMask   = ETH_MAC_ADDR_MASK_DISABLE;
        for (i = 0U; i < ETH_MAC_ADDR_BYTE_LEN; i++) {
            pstcMacAddrInit->au8MacAddr[i] = 0x00U;
        }
    }

    return i32Ret;
}

/**
 * @brief  Set MAC Address.
 * @param  [in] u32Index                MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_IDX0:    MAC address 0
 *           @arg ETH_MAC_ADDR_IDX1:    MAC address 1
 *           @arg ETH_MAC_ADDR_IDX2:    MAC address 2
 *           @arg ETH_MAC_ADDR_IDX3:    MAC address 3
 *           @arg ETH_MAC_ADDR_IDX4:    MAC address 4
 * @param  [in] au8Addr                 Pointer to MAC address buffer(6 bytes).
 * @retval int32_t:
 *           - LL_OK: Set address success
 *           - LL_ERR_INVD_PARAM: au8Addr == NULL
 */
int32_t ETH_MACADDR_SetAddr(uint32_t u32Index, uint8_t au8Addr[])
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32TempReg;
    uint32_t *pu32AddrLow;

