RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    if (NULL == au8Addr) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_ADDR_NORMAL_INDEX(u32Index));

        MACADHR = ETH_MAC_MACADHR_ADDR(u32Index);
        MACADLR = ETH_MAC_MACADLR_ADDR(u32Index);
        /* Set MAC address high register */
        u32TempReg = ((uint32_t)au8Addr[5] << 8U) | (uint32_t)au8Addr[4];
        WRITE_REG32(*MACADHR, u32TempReg);
        /* Set MAC address low register */
        pu32AddrLow = (uint32_t *)((uint32_t) & (au8Addr[0]));
        WRITE_REG32(*MACADLR, *pu32AddrLow);
    }

    return i32Ret;
}

/**
 * @brief  Get MAC Address.
 * @param  [in] u32Index                MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_IDX0:    MAC address 0
 *           @arg ETH_MAC_ADDR_IDX1:    MAC address 1
 *           @arg ETH_MAC_ADDR_IDX2:    MAC address 2
 *           @arg ETH_MAC_ADDR_IDX3:    MAC address 3
 *           @arg ETH_MAC_ADDR_IDX4:    MAC address 4
 * @param  [out] au8Addr                Pointer to MAC address buffer(6 bytes).
 * @retval int32_t:
 *           - LL_OK: Set address success
 *           - LL_ERR_INVD_PARAM: au8Addr == NULL
 */
int32_t ETH_MACADDR_GetAddr(uint32_t u32Index, uint8_t au8Addr[])
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *MACADHR;
    __IO uint32_t *MACADLR;
    uint32_t u32TempReg;
    uint32_t *pu32AddrLow;

    if (NULL == au8Addr) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_ADDR_NORMAL_INDEX(u32Index));

        MACADHR    = ETH_MAC_MACADHR_ADDR(u32Index);
        MACADLR    = ETH_MAC_MACADLR_ADDR(u32Index);
        /* Get MAC address high */
        u32TempReg = READ_REG32(*MACADHR);
        au8Addr[5] = (uint8_t)((u32TempReg >> 8U) & 0x000000FFUL);
        au8Addr[4] = (uint8_t)(u32TempReg & 0x000000FFUL);
        /* Get MAC address low */
        pu32AddrLow = (uint32_t *)((uint32_t) & (au8Addr[0]));
        *pu32AddrLow = READ_REG32(*MACADLR);
    }

    return i32Ret;
}

/**
 * @brief  Set MAC Address filter mode.
 * @param  [in] u32Index                MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_IDX1:    MAC address 1
 *           @arg ETH_MAC_ADDR_IDX2:    MAC address 2
 *           @arg ETH_MAC_ADDR_IDX3:    MAC address 3
 *           @arg ETH_MAC_ADDR_IDX4:    MAC address 4
 * @param  [in] u32Mode                 MAC address filter mode.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_FILTER_DISABLE:              Disable perfect filter with MAC address.
 *           @arg ETH_MAC_ADDR_FILTER_PERFECT_DEST_ADDR:    Filter the DA address of the received frame with MAC address.
 *           @arg ETH_MAC_ADDR_FILTER_PERFECT_SRC_ADDR:     Filter the SA address of the received frame with MAC address.
 * @retval None
 */
void ETH_MACADDR_SetFilterMode(uint32_t u32Index, uint32_t u32Mode)
{
    __IO uint32_t *MACADHR;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_ADDR_SPEC_INDEX(u32Index));
    DDL_ASSERT(IS_ETH_MAC_ADDR_FILTER(u32Mode));

    MACADHR = ETH_MAC_MACADHR_ADDR(u32Index);
    MODIFY_REG32(*MACADHR, (ETH_MAC_MACADHR1_SA1 | ETH_MAC_MACADHR1_AE1), u32Mode);
}

/**
 * @brief  Set MAC Address Transmit priority ratio.
 * @param  [in] u32Index                MAC address index.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_ADDR_IDX1:    MAC address 1
 *           @arg ETH_MAC_ADDR_IDX2:    MAC address 2
 *           @arg ETH_MAC_ADDR_IDX3:    MAC address 3
 *           @arg ETH_MAC_ADDR_IDX4:    MAC address 4
 * @param  [in] u32Mask                 MAC address filter mask.
 *         This parameter can be one of the following values or any combination of BYTE1 through BYTE6:
 *           @arg ETH_MAC_ADDR_MASK_DISABLE: Disable MAC Address Mask
 *           @arg ETH_MAC_ADDR_MASK_BYTE6:   Mask MAC Address high reg bits [15:8]
 *           @arg ETH_MAC_ADDR_MASK_BYTE5:   Mask MAC Address high reg bits [7:0]
 *           @arg ETH_MAC_ADDR_MASK_BYTE4:   Mask MAC Address low reg bits [31:24]
 *           @arg ETH_MAC_ADDR_MASK_BYTE3:   Mask MAC Address low reg bits [23:16]
 *           @arg ETH_MAC_ADDR_MASK_BYTE2:   Mask MAC Address low reg bits [15:8]
 *           @arg ETH_MAC_ADDR_MASK_BYTE1:   Mask MAC Address low reg bits [7:0]
 *           @arg ETH_MAC_ADDR_MASK_ALL:     Mask MAC Address low reg bits [31:0] and low high bits [15:0]
 * @retval None
 */
void ETH_MACADDR_SetFilterMask(uint32_t u32Index, uint32_t u32Mask)
{
    __IO uint32_t *MACADHR;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_ADDR_SPEC_INDEX(u32Index));
    DDL_ASSERT(IS_ETH_MAC_ADDR_MASK(u32Mask));

    MACADHR = ETH_MAC_MACADHR_ADDR(u32Index);
    MODIFY_REG32(*MACADHR, ETH_MAC_MACADHR1_MBC1, u32Mask);
}

/******************************************************************************/
/*                        MAC L3L4 Filter Functions                           */
/******************************************************************************/
/**
 * @brief  De-Initialize MAC L3L4 Filter.
 * @param  None
 * @retval None
 */
void ETH_MAC_L3L4FilterDeInit(void)
{
    WRITE_REG32(bCM_ETH->MAC_FLTCTLR_b.IPFE, DISABLE);
    WRITE_REG32(CM_ETH->MAC_L34CTLR,  0UL);
    WRITE_REG32(CM_ETH->MAC_L4PORTR,  0UL);
    WRITE_REG32(CM_ETH->MAC_L3ADDRR0, 0UL);
    WRITE_REG32(CM_ETH->MAC_L3ADDRR1, 0UL);
    WRITE_REG32(CM_ETH->MAC_L3ADDRR2, 0UL);
    WRITE_REG32(CM_ETH->MAC_L3ADDRR3, 0UL);
}

/**
 * @brief  Initialize MAC L3L4 Filter.
 * @param  [in] pstcL3L4FilterInit      Pointer to a @ref stc_eth_l3l4_filter_config_t structure
 * @retval int32_t:
 *           - LL_OK: MAC L3L4 Filter Initialize success
 *           - LL_ERR_INVD_PARAM: pstcL3L4FilterInit == NULL
 */
int32_t ETH_MAC_L3L4FilterInit(const stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcL3L4FilterInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MAC_L4_DEST_PORT_FILTER(pstcL3L4FilterInit->u32DestPortFilter));
        DDL_ASSERT(IS_ETH_MAC_L4_SRC_PORT_FILTER(pstcL3L4FilterInit->u32SrcPortFilter));
        DDL_ASSERT(IS_ETH_MAC_L4_PORT_FILTER_PROTOCOL(pstcL3L4FilterInit->u32PortFilterProtocol));
        DDL_ASSERT(IS_ETH_MAC_L3_DEST_ADDR_FILTER_MASK(pstcL3L4FilterInit->u32Ip4DestAddrFilterMask));
        DDL_ASSERT(IS_ETH_MAC_L3_SRC_ADDR_FILTER_MASK(pstcL3L4FilterInit->u32Ip4SrcAddrFilterMask));
        DDL_ASSERT(IS_ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK(pstcL3L4FilterInit->u32Ip6AddrFilterMask));
        DDL_ASSERT(IS_ETH_MAC_L3_DEST_ADDR_FILTER(pstcL3L4FilterInit->u32DestAddrFilter));
        DDL_ASSERT(IS_ETH_MAC_L3_SRC_ADDR_FILTER(pstcL3L4FilterInit->u32SrcAddrFilter));
        DDL_ASSERT(IS_ETH_MAC_L3_ADDR_FILTER_PROTOCOL(pstcL3L4FilterInit->u32AddrFilterProtocol));

