RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
        /* Set L3/L4 control register */
        if (ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4 != pstcL3L4FilterInit->u32AddrFilterProtocol) {
            WRITE_REG32(CM_ETH->MAC_L34CTLR,
                        (pstcL3L4FilterInit->u32DestPortFilter     | pstcL3L4FilterInit->u32SrcPortFilter     |
                         pstcL3L4FilterInit->u32PortFilterProtocol | pstcL3L4FilterInit->u32Ip6AddrFilterMask |
                         pstcL3L4FilterInit->u32DestAddrFilter     | pstcL3L4FilterInit->u32SrcAddrFilter     |
                         pstcL3L4FilterInit->u32AddrFilterProtocol));
            WRITE_REG32(CM_ETH->MAC_L3ADDRR0, pstcL3L4FilterInit->au32Ip6AddrFilterValue[0]);
            WRITE_REG32(CM_ETH->MAC_L3ADDRR1, pstcL3L4FilterInit->au32Ip6AddrFilterValue[1]);
            WRITE_REG32(CM_ETH->MAC_L3ADDRR2, pstcL3L4FilterInit->au32Ip6AddrFilterValue[2]);
            WRITE_REG32(CM_ETH->MAC_L3ADDRR3, pstcL3L4FilterInit->au32Ip6AddrFilterValue[3]);
        } else {    /* IPv4 protocol*/
            WRITE_REG32(CM_ETH->MAC_L34CTLR,
                        (pstcL3L4FilterInit->u32DestPortFilter       | pstcL3L4FilterInit->u32SrcPortFilter         |
                         pstcL3L4FilterInit->u32PortFilterProtocol   | pstcL3L4FilterInit->u32Ip4DestAddrFilterMask |
                         pstcL3L4FilterInit->u32Ip4SrcAddrFilterMask | pstcL3L4FilterInit->u32DestAddrFilter        |
                         pstcL3L4FilterInit->u32SrcAddrFilter        | pstcL3L4FilterInit->u32AddrFilterProtocol));
            WRITE_REG32(CM_ETH->MAC_L3ADDRR0, pstcL3L4FilterInit->u32Ip4SrcAddrFilterValue);
            WRITE_REG32(CM_ETH->MAC_L3ADDRR1, pstcL3L4FilterInit->u32Ip4DestAddrFilterValue);
        }
        WRITE_REG32(CM_ETH->MAC_L4PORTR, ((((uint32_t)pstcL3L4FilterInit->u16DestProtFilterValue) <<
                                           ETH_MAC_L4PORTR_L4DPVAL_POS) | pstcL3L4FilterInit->u16SrcProtFilterValue));
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_l3l4_filter_config_t to default values.
 * @param  [out] pstcL3L4FilterInit     Pointer to a @ref stc_eth_l3l4_filter_config_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcL3L4FilterInit == NULL
 */
int32_t ETH_MAC_L3L4FilterStructInit(stc_eth_l3l4_filter_config_t *pstcL3L4FilterInit)
{
    int32_t i32Ret = LL_OK;
    uint8_t i;

    if (NULL == pstcL3L4FilterInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcL3L4FilterInit->u32DestPortFilter           = ETH_MAC_L4_DEST_PORT_FILTER_DISABLE;
        pstcL3L4FilterInit->u32SrcPortFilter            = ETH_MAC_L4_SRC_PORT_FILTER_DISABLE;
        pstcL3L4FilterInit->u32PortFilterProtocol       = ETH_MAC_L4_PORT_FILTER_PROTOCOL_TCP;
        pstcL3L4FilterInit->u32Ip4DestAddrFilterMask    = ETH_MAC_L3_DEST_ADDR_FILTER_MASK_NONE;
        pstcL3L4FilterInit->u32Ip4SrcAddrFilterMask     = ETH_MAC_L3_SRC_ADDR_FILTER_MASK_NONE;
        pstcL3L4FilterInit->u32Ip6AddrFilterMask        = ETH_MAC_L3_DEST_SRC_ADDR_FILTER_MASK_NONE;
        pstcL3L4FilterInit->u32DestAddrFilter           = ETH_MAC_L3_DEST_ADDR_FILTER_DISABLE;
        pstcL3L4FilterInit->u32SrcAddrFilter            = ETH_MAC_SRC_ADDR_FILTER_DISABLE;
        pstcL3L4FilterInit->u32AddrFilterProtocol       = ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4;
        pstcL3L4FilterInit->u16DestProtFilterValue      = 0U;
        pstcL3L4FilterInit->u16SrcProtFilterValue       = 0U;
        pstcL3L4FilterInit->u32Ip4DestAddrFilterValue   = 0UL;
        pstcL3L4FilterInit->u32Ip4SrcAddrFilterValue    = 0UL;
        for (i = 0U; i < 4U; i++) {
            pstcL3L4FilterInit->au32Ip6AddrFilterValue[i] = 0UL;
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable MAC L3L4 Filter function.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MAC_L3L4FilterCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->MAC_FLTCTLR_b.IPFE, enNewState);
}

/**
 * @brief  Set L4 port filter protocol.
 * @param  [in] u32Protocol             MAC L4 port filter protocol.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_L4_PORT_FILTER_PROTOCOL_TCP:  Port filter for TCP frame
 *           @arg ETH_MAC_L4_PORT_FILTER_PROTOCOL_UDP:  Port filter for UDP frame
 * @retval None
 */
void ETH_MAC_SetPortFilterProtocol(uint32_t u32Protocol)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_L4_PORT_FILTER_PROTOCOL(u32Protocol));

    WRITE_REG32(bCM_ETH->MAC_L34CTLR_b.L4PEN, (u32Protocol >> ETH_MAC_L34CTLR_L4PEN_POS));
}

/**
 * @brief  Set L4 Destination port filter value.
 * @param  [in] u16Port                 The value of Destination port.
 * @retval None
 */
void ETH_MAC_SetDestPortFilterValue(uint16_t u16Port)
{
    MODIFY_REG32(CM_ETH->MAC_L4PORTR, ETH_MAC_L4PORTR_L4DPVAL, ((uint32_t)u16Port << 16U));
}

/**
 * @brief  Set L4 Source port filter value.
 * @param  [in] u16Port                 The value of Source port.
 * @retval None
 */
void ETH_MAC_SetSrcPortFilterValue(uint16_t u16Port)
{
    MODIFY_REG32(CM_ETH->MAC_L4PORTR, ETH_MAC_L4PORTR_L4SPVAL, u16Port);
}

/**
 * @brief  Set L3 address filter protocol.
 * @param  [in] u32Protocol             MAC L3 address filter protocol.
 *         This parameter can be one of the following values:
 *           @arg ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV4: Ip Address filter for IPv4
 *           @arg ETH_MAC_L3_ADDR_FILTER_PROTOCOL_IPV6: Ip Address filter for IPv6
 * @retval None
 */
void ETH_MAC_SetAddrFilterProtocol(uint32_t u32Protocol)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MAC_L3_ADDR_FILTER_PROTOCOL(u32Protocol));

    WRITE_REG32(bCM_ETH->MAC_L34CTLR_b.L3PEN, u32Protocol);
}

/**
 * @brief  Set L3 Destination address filter value of IPv4.
 * @param  [in] u32Addr                 The value of Destination address.
 * @retval None
 */
void ETH_MAC_SetIpv4DestAddrFilterValue(uint32_t u32Addr)
{
    WRITE_REG32(CM_ETH->MAC_L3ADDRR1, u32Addr);
}

/**
 * @brief  Set L3 Source address filter value of IPv4.
 * @param  [in] u32Addr                 The value of Source address.
 * @retval None
 */
void ETH_MAC_SetIpv4SrcAddrFilterValue(uint32_t u32Addr)
{
    WRITE_REG32(CM_ETH->MAC_L3ADDRR0, u32Addr);
}

/**
 * @brief  Set L3 Destination/Source Address filter value of IPv6.
 * @param  [in] au32Addr                Pointer to Destination/Source Address buffer(4 words).
 * @retval int32_t:
 *           - LL_OK: Set Address filter value success
 *           - LL_ERR_INVD_PARAM: au32Addr == NULL
 */
int32_t ETH_MAC_SetIpv6AddrFilterValue(const uint32_t au32Addr[])
{
    int32_t i32Ret = LL_OK;

