RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    if (NULL == au32Addr) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        WRITE_REG32(CM_ETH->MAC_L3ADDRR0, au32Addr[0]);
        WRITE_REG32(CM_ETH->MAC_L3ADDRR1, au32Addr[1]);
        WRITE_REG32(CM_ETH->MAC_L3ADDRR2, au32Addr[2]);
        WRITE_REG32(CM_ETH->MAC_L3ADDRR3, au32Addr[3]);
    }

    return i32Ret;
}

/******************************************************************************/
/*                              DMA Functions                                 */
/******************************************************************************/
/**
 * @brief  De-Initialize DMA.
 * @param  None
 * @retval None
 */
void ETH_DMA_DeInit(void)
{
    WRITE_REG32(CM_ETH->DMA_BUSMODR, 0x00020101UL);
    WRITE_REG32(CM_ETH->DMA_OPRMODR, 0U);
    WRITE_REG32(CM_ETH->DMA_INTENAR, 0U);
    WRITE_REG32(CM_ETH->DMA_REVWDTR, 0U);
    WRITE_REG32(CM_ETH->DMA_TXDLADR, 0U);
    WRITE_REG32(CM_ETH->DMA_RXDLADR, 0U);
}

/**
 * @brief  Initialize DMA.
 * @param  [in] pstcDmaInit             Pointer to a @ref stc_eth_dma_init_t structure
 * @retval int32_t:
 *           - LL_OK: DMA Initialize success
 *           - LL_ERR_INVD_PARAM: pstcDmaInit == NULL
 */
int32_t ETH_DMA_Init(const stc_eth_dma_init_t *pstcDmaInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcDmaInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_BURST_MD(pstcDmaInit->u32BurstMode));
        DDL_ASSERT(IS_ETH_DMA_ADDR_ALIGN(pstcDmaInit->u32AddrAlign));
        DDL_ASSERT(IS_ETH_DMA_RX_BURST_LEN(pstcDmaInit->u32RxBurstLen));
        DDL_ASSERT(IS_ETH_DMA_TX_BURST_LEN(pstcDmaInit->u32TxBurstLen));
        DDL_ASSERT(IS_ETH_DMA_ENHANCE_DESC(pstcDmaInit->u32EnhanceDesc));
        DDL_ASSERT(IS_ETH_DMA_DESC_SKIP_LEN(pstcDmaInit->u32DescSkipLen));
        DDL_ASSERT(IS_ETH_DMA_PRIO_ARBITRATION(pstcDmaInit->u32Arbitration));
        DDL_ASSERT(IS_ETH_DMA_DROP_CHECKSUM_ERR_FRAME(pstcDmaInit->u32DropChecksumErrorFrame));
        DDL_ASSERT(IS_ETH_DMA_RX_STORE_FORWARD(pstcDmaInit->u32ReceiveStoreForward));
        DDL_ASSERT(IS_ETH_DMA_FLUSH_RX_FRAME(pstcDmaInit->u32FlushReceiveFrame));
        DDL_ASSERT(IS_ETH_DMA_TRANS_STORE_FORWARD(pstcDmaInit->u32TransStoreForward));
        DDL_ASSERT(IS_ETH_DMA_TRANS_THRESHOLD(pstcDmaInit->u32TransThreshold));
        DDL_ASSERT(IS_ETH_DMA_FORWARD_ERR_FRAME(pstcDmaInit->u32ForwardErrorFrame));
        DDL_ASSERT(IS_ETH_DMA_FORWARD_UNDERSIZE_FRAME(pstcDmaInit->u32ForwardUndersizeFrame));
        DDL_ASSERT(IS_ETH_DMA_DROP_JUMBO_FRAME(pstcDmaInit->u32DropJumboFrame));
        DDL_ASSERT(IS_ETH_DMA_RX_THRESHOLD(pstcDmaInit->u32ReceiveThreshold));
        DDL_ASSERT(IS_ETH_DMA_SEC_FRAME_OPERA(pstcDmaInit->u32SecFrameOperate));

        /* Set Bus mode register */
        MODIFY_REG32(CM_ETH->DMA_BUSMODR, ETH_DMA_BUSMODR_CLR_MASK,
                     (pstcDmaInit->u32BurstMode   | pstcDmaInit->u32AddrAlign   | pstcDmaInit->u32RxBurstLen  |
                      pstcDmaInit->u32TxBurstLen  | pstcDmaInit->u32EnhanceDesc | pstcDmaInit->u32DescSkipLen |
                      pstcDmaInit->u32Arbitration | ETH_DMA_BUSMODR_SPBL));
        /* Set Operation mode register */
        MODIFY_REG32(CM_ETH->DMA_OPRMODR, ETH_DMA_OPRMODR_CLR_MASK,
                     (pstcDmaInit->u32DropChecksumErrorFrame | pstcDmaInit->u32ReceiveStoreForward |
                      pstcDmaInit->u32FlushReceiveFrame      | pstcDmaInit->u32TransStoreForward   |
                      pstcDmaInit->u32TransThreshold         | pstcDmaInit->u32ForwardErrorFrame   |
                      pstcDmaInit->u32ForwardUndersizeFrame  | pstcDmaInit->u32DropJumboFrame      |
                      pstcDmaInit->u32ReceiveThreshold       | pstcDmaInit->u32SecFrameOperate));
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_dma_init_t to default values.
 * @param  [out] pstcDmaInit            Pointer to a @ref stc_eth_dma_init_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcDmaInit == NULL
 */
int32_t ETH_DMA_StructInit(stc_eth_dma_init_t *pstcDmaInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcDmaInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcDmaInit->u32BurstMode               = ETH_DMA_BURST_MD_FIXED;
        pstcDmaInit->u32AddrAlign               = ETH_DMA_ADDR_ALIGN_ENABLE;
        pstcDmaInit->u32RxBurstLen              = ETH_DMA_RX_BURST_LEN_32BEAT;
        pstcDmaInit->u32TxBurstLen              = ETH_DMA_TX_BURST_LEN_32BEAT;
        pstcDmaInit->u32EnhanceDesc             = ETH_DMA_ENHANCE_DESC_ENABLE;
        pstcDmaInit->u32DescSkipLen             = 0U;
        pstcDmaInit->u32Arbitration             = ETH_DMA_ARBITRATION_LOOP_RXTX_1_1;
        pstcDmaInit->u32DropChecksumErrorFrame  = ETH_DMA_DROP_CHECKSUM_ERR_FRAME_ENABLE;
        pstcDmaInit->u32ReceiveStoreForward     = ETH_DMA_RX_STORE_FORWARD_ENABLE;
        pstcDmaInit->u32FlushReceiveFrame       = ETH_DMA_FLUSH_RX_FRAME_ENABLE;
        pstcDmaInit->u32TransStoreForward       = ETH_DMA_TRANS_STORE_FORWARD_ENABLE;
        pstcDmaInit->u32TransThreshold          = ETH_DMA_TRANS_THRESHOLD_64BYTE;
        pstcDmaInit->u32ForwardErrorFrame       = ETH_DMA_FORWARD_ERR_FRAME_DISABLE;
        pstcDmaInit->u32ForwardUndersizeFrame   = ETH_DMA_FORWARD_UNDERSIZE_FRAME_DISABLE;
        pstcDmaInit->u32DropJumboFrame          = ETH_DMA_DROP_JUMBO_FRAME_DISABLE;
        pstcDmaInit->u32ReceiveThreshold        = ETH_DMA_RX_THRESHOLD_64BYTE;
        pstcDmaInit->u32SecFrameOperate         = ETH_DMA_SEC_FRAME_OPERA_ENABLE;
    }

    return i32Ret;
}

/**
 * @brief  Set DMA software reset.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Software reset success
 *           - LL_ERR_TIMEOUT: Reset timeout
 */
int32_t ETH_DMA_SoftwareReset(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    WRITE_REG32(bCM_ETH->DMA_BUSMODR_b.SWR, 1U);
    u32Count = ETH_SW_RST_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bCM_ETH->DMA_BUSMODR_b.SWR)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    return i32Ret;
}

/**
 * @brief  Set DMA Transmit priority ratio.
 * @param  [in] u32Ratio                Priority ratio
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_1_1:        Rx:Tx = 1:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_2_1:        Rx:Tx = 2:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_3_1:        Rx:Tx = 3:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_RXTX_4_1:        Rx:Tx = 4:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_1_1:        Tx:Rx = 1:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_2_1:        Tx:Rx = 2:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_3_1:        Tx:Rx = 3:1
 *           @arg ETH_DMA_ARBITRATION_LOOP_TXRX_4_1:        Tx:Rx = 4:1
 *           @arg ETH_DMA_ARBITRATION_FIXED_RX_PRIOR_TX:    Fixed priority: Rx is higher than Tx
 *           @arg ETH_DMA_ARBITRATION_FIXED_TX_PRIOR_RX:    Fixed priority: Tx is higher than Rx
 * @retval None
 */
void ETH_DMA_SetTransPriorityRatio(uint32_t u32Ratio)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_PRIO_ARBITRATION(u32Ratio));

    MODIFY_REG32(CM_ETH->DMA_BUSMODR, (ETH_DMA_BUSMODR_TXPR | ETH_DMA_BUSMODR_PRAT | ETH_DMA_BUSMODR_DMAA), u32Ratio);
}

/**
 * @brief  Set DMA Rx watchdog counter.
 * @param  [in] u8Value                 The value of Watchdog timer
 * @retval None
 */
void ETH_DMA_SetRxWatchdogCounter(uint8_t u8Value)
{
    WRITE_REG32(CM_ETH->DMA_REVWDTR, u8Value);
}

/**
 * @brief  Flush transmit FIFO.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Flush transmit FIFO success
 *           - LL_ERR_TIMEOUT: Flush timeout
 */
int32_t ETH_DMA_FlushTransFIFO(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    WRITE_REG32(bCM_ETH->DMA_OPRMODR_b.FTF, 1U);
    u32Count = ETH_WR_REG_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bCM_ETH->DMA_OPRMODR_b.FTF)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable DMA transmit.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_DMA_TransCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->DMA_OPRMODR_b.STT, enNewState);
}

/**
 * @brief  Enable or disable DMA receive.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_DMA_ReceiveCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->DMA_OPRMODR_b.STR, enNewState);
}

/**
 * @brief  Enable or disable DMA interrupt.
 * @param  [in] u32IntType              DMA interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_INT_NIE:      Normal interrupt summary
 *           @arg ETH_DMA_INT_AIE:      Abnormal interrupt summary
 *           @arg ETH_DMA_INT_ERE:      Early receive interrupt
 *           @arg ETH_DMA_INT_FBE:      Fatal bus error interrupt
 *           @arg ETH_DMA_INT_ETE:      Early transmit interrupt
 *           @arg ETH_DMA_INT_RWE:      Receive watchdog timeout interrupt
 *           @arg ETH_DMA_INT_RSE:      Receive process stopped interrupt
 *           @arg ETH_DMA_INT_RUE:      Receive buffer unavailable interrupt
 *           @arg ETH_DMA_INT_RIE:      Receive interrupt
 *           @arg ETH_DMA_INT_UNE:      Transmit Underflow interrupt
 *           @arg ETH_DMA_INT_OVE:      Receive Overflow interrupt
 *           @arg ETH_DMA_INT_TJE:      Transmit jabber timeout interrupt
 *           @arg ETH_DMA_INT_TUE:      Transmit buffer unavailable interrupt
 *           @arg ETH_DMA_INT_TSE:      Transmit process stopped interrupt
 *           @arg ETH_DMA_INT_TIE:      Transmit interrupt
 *           @arg ETH_DMA_INT_ALL:      All of the above
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_DMA_IntCmd(uint32_t u32IntType, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG32_BIT(CM_ETH->DMA_INTENAR, u32IntType);
    } else {
        CLR_REG32_BIT(CM_ETH->DMA_INTENAR, u32IntType);
    }
}

/**
 * @brief  Get DMA flag status.
 * @param  [in] u32Flag                 DMA flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_FLAG_PTPS:    Time-stamp trigger status
 *           @arg ETH_DMA_FLAG_PMTS:    PMT trigger status
 *           @arg ETH_DMA_FLAG_MMCS:    MMC trigger status
 *           @arg ETH_DMA_FLAG_NIS:     Normal interrupt summary flag
 *           @arg ETH_DMA_FLAG_AIS:     Abnormal interrupt summary flag
 *           @arg ETH_DMA_FLAG_ERS:     Early receive flag
 *           @arg ETH_DMA_FLAG_FBS:     Fatal bus error flag
 *           @arg ETH_DMA_FLAG_ETS:     Early transmit flag
 *           @arg ETH_DMA_FLAG_RWS:     Receive watchdog timeout flag
 *           @arg ETH_DMA_FLAG_RSS:     Receive stopped flag
 *           @arg ETH_DMA_FLAG_RUS:     Receive buffer unavailable flag
 *           @arg ETH_DMA_FLAG_RIS:     Receive flag
 *           @arg ETH_DMA_FLAG_UNS:     Transmit Underflow flag
 *           @arg ETH_DMA_FLAG_OVS:     Receive Overflow flag
 *           @arg ETH_DMA_FLAG_TJS:     Transmit jabber timeout flag
 *           @arg ETH_DMA_FLAG_TUS:     Transmit buffer unavailable flag
 *           @arg ETH_DMA_FLAG_TSS:     Transmit stopped flag
 *           @arg ETH_DMA_FLAG_TIS:     Transmit interrupt flag
 *           @arg ETH_DMA_FLAG_ALL:     All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_DMA_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->DMA_DMASTSR, u32Flag))) {
        enFlagSta = SET;
    }

