RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    return enFlagSta;
}

/**
 * @brief  Clear DMA flag.
 * @param  [in] u32Flag                 DMA flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_FLAG_NIS:     Normal interrupt summary flag
 *           @arg ETH_DMA_FLAG_AIS:     Abnormal interrupt summary flag
 *           @arg ETH_DMA_FLAG_ERS:     Early receive flag
 *           @arg ETH_DMA_FLAG_FBS:     Fatal bus error flag
 *           @arg ETH_DMA_FLAG_ETS:     Early transmit flag
 *           @arg ETH_DMA_FLAG_RWS:     Receive watchdog timeout flag
 *           @arg ETH_DMA_FLAG_RSS:     Receive stopped flag
 *           @arg ETH_DMA_FLAG_RUS:     Receive buffer unavailable flag
 *           @arg ETH_DMA_FLAG_RIS:     Receive flag
 *           @arg ETH_DMA_FLAG_UNS:     Transmit Underflow flag
 *           @arg ETH_DMA_FLAG_OVS:     Receive Overflow flag
 *           @arg ETH_DMA_FLAG_TJS:     Transmit jabber timeout flag
 *           @arg ETH_DMA_FLAG_TUS:     Transmit buffer unavailable flag
 *           @arg ETH_DMA_FLAG_TSS:     Transmit stopped flag
 *           @arg ETH_DMA_FLAG_TIS:     Transmit interrupt flag
 *           @arg ETH_DMA_FLAG_CLR_ALL: All of the above
 * @retval None
 */
void ETH_DMA_ClearStatus(uint32_t u32Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_CLR_FLAG(u32Flag));

    WRITE_REG32(CM_ETH->DMA_DMASTSR, u32Flag);
}

/**
 * @brief  Get DMA overflow flag status.
 * @param  [in] u32Flag                 DMA overflow flag type
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_OVF_RXFIFO_CNT:       Overflow bit for FIFO overflow counter
 *           @arg ETH_DMA_OVF_MISS_FRAME_CNT:   Overflow bit for miss frame counter
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_DMA_GetOvfStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_MISS_FRAME_TYPE(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->DMA_RFRCNTR, u32Flag))) {
        enFlagSta = SET;
    }

    return enFlagSta;
}

/******************************************************************************/
/*                          DMA descriptor Functions                          */
/******************************************************************************/
/**
 * @brief  Initializes DMA Tx descriptor in chain mode.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] astcTxDescTab           Pointer to the first Tx desc list
 * @param  [in] au8TxBuf                Pointer to the first TxBuffer list
 * @param  [in] u32TxBufCnt             Number of the Tx desc in the list
 * @retval int32_t:
 *           - LL_OK: Initializes Tx chain mode success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL or astcTxDescTab == NULL or au8TxBuf == NULL or u32TxBufCnt == 0
 */
int32_t ETH_DMA_TxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcTxDescTab[],
                               const uint8_t au8TxBuf[], uint32_t u32TxBufCnt)
{
    uint32_t i;
    stc_eth_dma_desc_t *pstcTxDesc;
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcEthHandle) || (NULL == astcTxDescTab) || (NULL == au8TxBuf) || (0UL == u32TxBufCnt)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Set the DMATxDesc pointer with the first in the astcTxDescTab list */
        pstcEthHandle->stcTxDesc = astcTxDescTab;
        /* Fill each DMATxDesc descriptor */
        for (i = 0U; i < u32TxBufCnt; i++) {
            pstcTxDesc = &astcTxDescTab[i];
            /* Set Second Address Chained */
            pstcTxDesc->u32ControlStatus = ETH_DMA_TXDESC_TSAC;
            /* Set Buffer1 address pointer */
            pstcTxDesc->u32Buf1Addr = (uint32_t)(&au8TxBuf[i * ETH_TX_BUF_SIZE]);
            /* Set the DMA Tx descriptors checksum insertion */
            if (ETH_MAC_CHECKSUM_MD_HW == pstcEthHandle->stcCommInit.u32ChecksumMode) {
                SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_CIC_TCPUDPICMP_FULL);
            }
            /* Initialize the next descriptor with the Next Descriptor Polling */
            if (i < (u32TxBufCnt - 1U)) {
                pstcTxDesc->u32Buf2NextDescAddr = (uint32_t)(&astcTxDescTab[i + 1U]);
            } else {
                pstcTxDesc->u32Buf2NextDescAddr = (uint32_t)astcTxDescTab;
            }
        }
        /* Set Transmit Descriptor List Address Register */
        WRITE_REG32(CM_ETH->DMA_TXDLADR, (uint32_t)astcTxDescTab);
    }

    return i32Ret;
}

/**
 * @brief  Initializes DMA Rx descriptor in chain mode.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] astcRxDescTab           Pointer to the first Rx desc list
 * @param  [in] au8RxBuf                Pointer to the first RxBuffer list
 * @param  [in] u32RxBufCnt             Number of the Rx desc in the list
 * @retval int32_t:
 *           - LL_OK: Initializes Rx chain mode success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL or astcRxDescTab == NULL or au8RxBuf == NULL or u32RxBufCnt == 0
 */
int32_t ETH_DMA_RxDescListInit(stc_eth_handle_t *pstcEthHandle, stc_eth_dma_desc_t astcRxDescTab[],
                               const uint8_t au8RxBuf[], uint32_t u32RxBufCnt)
{
    uint32_t i;
    stc_eth_dma_desc_t *pstcRxDesc;
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcEthHandle) || (NULL == astcRxDescTab) || (NULL == au8RxBuf) || (0UL == u32RxBufCnt)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Set the DMARxDesc pointer with the first in the astcRxDescTab list */
        pstcEthHandle->stcRxDesc = astcRxDescTab;
        /* Fill each DMARxDesc descriptor */
        for (i = 0UL; i < u32RxBufCnt; i++) {
            pstcRxDesc = &astcRxDescTab[i];
            /* Set Own bit of the Rx descriptor */
            pstcRxDesc->u32ControlStatus  = ETH_DMA_RXDESC_OWN;
            /* Set Buffer1 size and Second Address Chained */
            pstcRxDesc->u32ControlBufSize = ETH_RX_BUF_SIZE | ETH_DMA_RXDESC_RSAC;
            /* Set Buffer1 address pointer */
            pstcRxDesc->u32Buf1Addr       = (uint32_t)(&au8RxBuf[i * ETH_RX_BUF_SIZE]);
            /* Set the DMA Rx Descriptor interrupt */
            if (ETH_RX_MD_INT == pstcEthHandle->stcCommInit.u32ReceiveMode) {
                CLR_REG32_BIT(pstcRxDesc->u32ControlBufSize, ETH_DMA_RXDESC_DIC);
            }
            /* Initialize the next descriptor with the Next Descriptor Polling */
            if (i < (u32RxBufCnt - 1U)) {
                pstcRxDesc->u32Buf2NextDescAddr = (uint32_t)(&astcRxDescTab[i + 1U]);
            } else {
                pstcRxDesc->u32Buf2NextDescAddr = (uint32_t)astcRxDescTab;
            }
        }
        /* Set Receive Descriptor List Address Register */
        WRITE_REG32(CM_ETH->DMA_RXDLADR, (uint32_t)astcRxDescTab);
    }

    return i32Ret;
}

/**
 * @brief  Set DMA transmit frame.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @param  [in] u32FrameLen             Total of data to be transmit
 * @retval int32_t:
 *           - LL_OK: Set transmit frame success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL
 *           - LL_ERR_INVD_MD: Descriptor is owned by the DMA
 */
int32_t ETH_DMA_SetTransFrame(stc_eth_handle_t *pstcEthHandle, uint32_t u32FrameLen)
{
    uint32_t i;
    uint32_t u32BufCnt;
    uint32_t u32Size;
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcEthHandle) || (0U == u32FrameLen)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check if the descriptor is owned by the CPU */
        if (0UL != (pstcEthHandle->stcTxDesc->u32ControlStatus & ETH_DMA_TXDESC_OWN)) {
            i32Ret = LL_ERR_INVD_MD;
        } else {
            /* Get the number of needed Tx buffers for the current frame */
            if (u32FrameLen > ETH_TX_BUF_SIZE) {
                u32BufCnt = u32FrameLen / ETH_TX_BUF_SIZE;
                if (0UL != (u32FrameLen % ETH_TX_BUF_SIZE)) {
                    u32BufCnt++;
                }
            } else {
                u32BufCnt = 1U;
            }

            if (1U == u32BufCnt) {
                /* Set FIRST and LAST segment */
                SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, (ETH_DMA_TXDESC_TFS | ETH_DMA_TXDESC_TLS));
                /* Set frame size */
                MODIFY_REG32(pstcEthHandle->stcTxDesc->u32ControlBufSize, ETH_DMA_TXDESC_TBS1,
                             (u32FrameLen & ETH_DMA_TXDESC_TBS1));
                /* Set Own bit of the Tx descriptor */
                SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_OWN);
                /* Point to next descriptor */
                pstcEthHandle->stcTxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcTxDesc->u32Buf2NextDescAddr);
            } else {
                for (i = 0U; i < u32BufCnt; i++) {
                    /* Clear FIRST and LAST segment bits */
                    CLR_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus,
                                  (ETH_DMA_TXDESC_TFS | ETH_DMA_TXDESC_TLS));
                    if (0U == i) {
                        /* Set the FIRST segment bit */
                        SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_TFS);
                    }
                    if ((u32BufCnt - 1U) == i) {
                        /* Set the last segment bit */
                        SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_TLS);
                        u32Size = u32FrameLen - ((u32BufCnt - 1U) * ETH_TX_BUF_SIZE);
                        MODIFY_REG32(pstcEthHandle->stcTxDesc->u32ControlBufSize, ETH_DMA_TXDESC_TBS1,
                                     (u32Size & ETH_DMA_TXDESC_TBS1));
                    } else {
                        /* Set frame size */
                        MODIFY_REG32(pstcEthHandle->stcTxDesc->u32ControlBufSize, ETH_DMA_TXDESC_TBS1,
                                     (ETH_TX_BUF_SIZE & ETH_DMA_TXDESC_TBS1));
                    }

                    /* Set Own bit of the Tx descriptor */
                    SET_REG32_BIT(pstcEthHandle->stcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_OWN);
                    /* Pointer to next descriptor */
                    pstcEthHandle->stcTxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcTxDesc->u32Buf2NextDescAddr);
                }
            }

            /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
            if (0UL != (READ_REG32_BIT(CM_ETH->DMA_DMASTSR, ETH_DMA_FLAG_TUS))) {
                /* Clear DMA TUS flag */
                WRITE_REG32(CM_ETH->DMA_DMASTSR, ETH_DMA_FLAG_TUS);
                /* Resume DMA transmission */
                WRITE_REG32(CM_ETH->DMA_TXPOLLR, 0UL);
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Get DMA receive frame.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @retval int32_t:
 *           - LL_OK: Get receive frame success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL
 *           - LL_ERR: Not completed frame received
 */
int32_t ETH_DMA_GetReceiveFrame(stc_eth_handle_t *pstcEthHandle)
{
    int32_t i32Ret = LL_ERR;

    if (NULL == pstcEthHandle) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check if segment is not owned by DMA */
        if (0UL == (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMA_RXDESC_OWN)) {
            /* Check if last segment */
            if (0UL != (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMA_RXDESC_RLS)) {
                pstcEthHandle->stcRxFrame.u32SegCount++;
                pstcEthHandle->stcRxFrame.pstcLSDesc = pstcEthHandle->stcRxDesc;
                /* Check if last segment is first segment */
                if (1U == pstcEthHandle->stcRxFrame.u32SegCount) {
                    pstcEthHandle->stcRxFrame.pstcFSDesc = pstcEthHandle->stcRxDesc;
                }

                /* Get the Frame Length of the received packet: Strip FCS */
                pstcEthHandle->stcRxFrame.u32Len = ((pstcEthHandle->stcRxDesc->u32ControlStatus &
                                                     ETH_DMA_RXDESC_FRAL) >> ETH_DMA_RXDESC_FRAME_LEN_SHIFT) - 4U;
                /* Get the address of the buffer start address */
                pstcEthHandle->stcRxFrame.u32Buf = (pstcEthHandle->stcRxFrame.pstcFSDesc)->u32Buf1Addr;
                /* Pointer to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcRxDesc->u32Buf2NextDescAddr);
                /* Get success */
                i32Ret = LL_OK;
            } else if (0UL != (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMA_RXDESC_RFS)) {  /* Check if first segment */
                pstcEthHandle->stcRxFrame.pstcFSDesc  = pstcEthHandle->stcRxDesc;
                pstcEthHandle->stcRxFrame.pstcLSDesc  = NULL;
                pstcEthHandle->stcRxFrame.u32SegCount = 1U;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcRxDesc->u32Buf2NextDescAddr);
            } else {    /* Check if intermediate segment */
                pstcEthHandle->stcRxFrame.u32SegCount++;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcRxDesc->u32Buf2NextDescAddr);
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Get DMA receive frame in interrupt mode.
 * @param  [in] pstcEthHandle           Pointer to a @ref stc_eth_handle_t structure
 * @retval int32_t:
 *           - LL_OK: Get receive frame success
 *           - LL_ERR_INVD_PARAM: pstcEthHandle == NULL
 *           - LL_ERR: Not completed frame received
 */
int32_t ETH_DMA_GetReceiveFrame_Int(stc_eth_handle_t *pstcEthHandle)
{
    uint32_t u32DescCnt = 0U;
    int32_t i32Ret = LL_ERR;

    if (NULL == pstcEthHandle) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Scan descriptor owned by CPU */
        while ((0UL == (pstcEthHandle->stcRxDesc->u32ControlStatus & ETH_DMA_RXDESC_OWN)) &&
                (u32DescCnt < ETH_RX_BUF_SIZE)) {
            u32DescCnt++;
            /* Check if first segment in frame */
            if (ETH_DMA_RXDESC_RFS == (pstcEthHandle->stcRxDesc->u32ControlStatus &
                                       (ETH_DMA_RXDESC_RFS | ETH_DMA_RXDESC_RLS))) {
                pstcEthHandle->stcRxFrame.pstcFSDesc  = pstcEthHandle->stcRxDesc;
                pstcEthHandle->stcRxFrame.pstcLSDesc  = NULL;
                pstcEthHandle->stcRxFrame.u32SegCount = 1U;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcRxDesc->u32Buf2NextDescAddr);
            } else if (0UL == (pstcEthHandle->stcRxDesc->u32ControlStatus & (ETH_DMA_RXDESC_RFS | ETH_DMA_RXDESC_RLS))) {
                /* Check if intermediate segment */
                pstcEthHandle->stcRxFrame.u32SegCount++;
                /* Point to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcRxDesc->u32Buf2NextDescAddr);
            } else {    /* Last segment */
                pstcEthHandle->stcRxFrame.u32SegCount++;
                /* Last segment */
                pstcEthHandle->stcRxFrame.pstcLSDesc = pstcEthHandle->stcRxDesc;
                /* Check if last segment is first segment */
                if (1U == pstcEthHandle->stcRxFrame.u32SegCount) {
                    pstcEthHandle->stcRxFrame.pstcFSDesc = pstcEthHandle->stcRxDesc;
                }

                /* Get the Frame Length of the received packet: Strip FCS */
                pstcEthHandle->stcRxFrame.u32Len = ((pstcEthHandle->stcRxDesc->u32ControlStatus &
                                                     ETH_DMA_RXDESC_FRAL) >> ETH_DMA_RXDESC_FRAME_LEN_SHIFT) - 4U;
                /* Get the address of the buffer start address */
                pstcEthHandle->stcRxFrame.u32Buf = (pstcEthHandle->stcRxFrame.pstcFSDesc)->u32Buf1Addr;
                /* Pointer to next descriptor */
                pstcEthHandle->stcRxDesc = (stc_eth_dma_desc_t *)(pstcEthHandle->stcRxDesc->u32Buf2NextDescAddr);
                /* Get success */
                i32Ret = LL_OK;
                break;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Set DMA Tx descriptor own bit.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Owner                DMA Tx descriptor owner
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_DESC_OWN_CPU: Descriptor is owned by CPU
 *           @arg ETH_DMA_DESC_OWN_DMA: Descriptor is owned by DMA
 * @retval int32_t:
 *           - LL_OK: Set Tx descriptor own bit success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_SetTxDescOwn(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Owner)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_DESC_OWN(u32Owner));

        if (ETH_DMA_DESC_OWN_CPU != u32Owner) {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_OWN);
        } else {
            CLR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_OWN);
        }
    }

    return i32Ret;
}

/**
 * @brief  Set DMA Tx descriptor buffer size.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u8BufNum                Buffer sequence number
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_DESC_BUF1:    DMA Tx Desc Buffer1
 *           @arg ETH_DMA_DESC_BUF2:    DMA Tx Desc Buffer2
 * @param  [in] u32BufSize              DMA Tx buffer size
 * @retval int32_t:
 *           - LL_OK: Set Tx descriptor buffer size success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_SetTxDescBufSize(stc_eth_dma_desc_t *pstcTxDesc, uint8_t u8BufNum, uint32_t u32BufSize)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32ShiftBit = 0UL;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_DESC_BUF(u8BufNum));
        DDL_ASSERT(IS_ETH_DMA_TXDESC_BUF_SIZE(u32BufSize));

        /* DMA Tx Desc buffer2 */
        if (ETH_DMA_DESC_BUF1 != u8BufNum) {
            u32ShiftBit = ETH_DMA_DESC_BUF2_SIZE_SHIFT;
        }
        MODIFY_REG32(pstcTxDesc->u32ControlBufSize, (ETH_DMA_TXDESC_TBS1 << u32ShiftBit),
                     (u32BufSize << u32ShiftBit));
    }

    return i32Ret;
}

/**
 * @brief  Configure DMA Tx descriptor checksum insert.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32ChecksumMode         Checksum insert mode
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_TXDESC_CHECKSUM_BYPASS:               Checksum Engine is bypassed
 *           @arg ETH_DMA_TXDESC_CHECKSUM_IPV4_HEADER:          IPv4 header checksum insertion
 *           @arg ETH_DMA_TXDESC_CHECKSUM_TCPUDPICMP_SEGMENT:   TCP/UDP/ICMP Checksum Insertion calculated over segment only
 *           @arg ETH_DMA_TXDESC_CHECKSUM_TCPUDPICMP_FULL:      TCP/UDP/ICMP Checksum Insertion fully calculated
 * @retval int32_t:
 *           - LL_OK: Configure Tx descriptor checksum insert success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescChecksumInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32ChecksumMode)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_TXDESC_CHECKSUM_CTRL(u32ChecksumMode));

        MODIFY_REG32(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_CIC, u32ChecksumMode);
    }

    return i32Ret;
}

/**
 * @brief  Configure DMA Tx descriptor VLAN insert.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32VlanMode             VLAN insert mode
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_TXDESC_VLAN_BYPASS:       VLAN Insertion is bypassed
 *           @arg ETH_DMA_TXDESC_VLAN_REMOVE_TAG:   Remove Tag and Type fields in VLAN frame
 *           @arg ETH_DMA_TXDESC_VLAN_INSERT_TAG:   Insert VLAN Tag value in ETH_MAC_VTACTLR Register into transmit frame
 *           @arg ETH_DMA_TXDESC_VLAN_REPLACE_TAG:  Replace VLAN tag value in transmit frame with VLAN tag value in ETH_MAC_VTACTLR register
 * @retval int32_t:
 *           - LL_OK: Configure Tx descriptor VLAN insert success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescVlanInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32VlanMode)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_TXDESC_VLAN_CTRL(u32VlanMode));

        MODIFY_REG32(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_VLANC, u32VlanMode);
    }

    return i32Ret;
}

/**
 * @brief  Configure DMA Tx descriptor SA insert.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Mode                 SA insert mode
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_TXDESC_SAIRC_BYPASS:              Source Address Insertion or Replace Control is bypassed
 *           @arg ETH_DMA_TXDESC_SAIRC_INSTER_MACADDR0:     Insert address value in MAC address register 0 into transmit frame as SA address
 *           @arg ETH_DMA_TXDESC_SAIRC_REPLACE_MACADDR0:    Replace SA address in transmit frame with address value in MAC address register 0
 *           @arg ETH_DMA_TXDESC_SAIRC_INSTER_MACADDR1:     Insert address value in MAC address register 1 into transmit frame as SA address
 *           @arg ETH_DMA_TXDESC_SAIRC_REPLACE_MACADDR1:    Replace SA address in transmit frame with address value in MAC address register 1
 * @retval int32_t:
 *           - LL_OK: Configure Tx descriptor SA insert success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescSrcAddrInsertConfig(stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Mode)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_TXDESC_SRC_ADDR_CTRL(u32Mode));

        MODIFY_REG32(pstcTxDesc->u32ControlBufSize, ETH_DMA_TXDESC_SAIRC, u32Mode);
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable DMA Tx descriptor add CRC.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Configure Tx add CRC success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescCrcCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        if (DISABLE != enNewState) {
            CLR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_DCRC);
        } else {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_DCRC);
        }
    }

    return i32Ret;
}

