RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
/**
 * @brief  Enable or disable DMA Tx descriptor padding.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Configure Tx padding success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescPadCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        if (DISABLE != enNewState) {
            CLR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_DPAD);
        } else {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_DPAD);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable DMA Tx descriptor timestamp.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Configure Tx padding success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescTimestamp(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        if (DISABLE != enNewState) {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_TTSE);
        } else {
            CLR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_TTSE);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable DMA Tx descriptor replace CRC.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Configure Tx replace CRC success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescReplaceCrcCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        if (DISABLE != enNewState) {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_CRCR);
        } else {
            CLR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_CRCR);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable DMA Tx finished interrupt.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Configure Tx interrupt configure success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL
 */
int32_t ETH_DMA_TxDescIntCmd(stc_eth_dma_desc_t *pstcTxDesc, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcTxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        if (DISABLE != enNewState) {
            SET_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_IOC);
        } else {
            CLR_REG32_BIT(pstcTxDesc->u32ControlStatus, ETH_DMA_TXDESC_IOC);
        }
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Tx descriptor flag status.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Flag                 DMA Tx descriptor flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_TXDESC_OWN:   OWN bit
 *           @arg ETH_DMA_TXDESC_IOC:   Interrupt on Completion
 *           @arg ETH_DMA_TXDESC_TLS:   Transmit Last Segment
 *           @arg ETH_DMA_TXDESC_TFS:   Transmit First Segment
 *           @arg ETH_DMA_TXDESC_DCRC:  Disable CRC
 *           @arg ETH_DMA_TXDESC_DPAD:  Disable Padding
 *           @arg ETH_DMA_TXDESC_TTSE:  Transmit Time Stamp Enable
 *           @arg ETH_DMA_TXDESC_CRCR:  CRC Replace Control
 *           @arg ETH_DMA_TXDESC_TER:   Transmit End of Ring
 *           @arg ETH_DMA_TXDESC_TSAC:  Second Address Chained
 *           @arg ETH_DMA_TXDESC_TTSS:  Tx Time Stamp Status
 *           @arg ETH_DMA_TXDESC_IHE:   IP Header Error
 *           @arg ETH_DMA_TXDESC_ETSUM: Tx Error summary
 *           @arg ETH_DMA_TXDESC_JTE:   Jabber Timeout Error
 *           @arg ETH_DMA_TXDESC_FFF:   Frame Flushed
 *           @arg ETH_DMA_TXDESC_TPCE:  Payload Checksum Error
 *           @arg ETH_DMA_TXDESC_LOCE:  Loss Carrier Error
 *           @arg ETH_DMA_TXDESC_NCE:   No Carrier Error
 *           @arg ETH_DMA_TXDESC_TLCE:  Late Collision Error
 *           @arg ETH_DMA_TXDESC_ECE:   Excessive Collision Error
 *           @arg ETH_DMA_TXDESC_VLF:   VLAN Frame
 *           @arg ETH_DMA_TXDESC_EDE:   Excessive Deferral Error
 *           @arg ETH_DMA_TXDESC_UDE:   Underflow Error
 *           @arg ETH_DMA_TXDESC_DEE:   Deferred Error
 *           @arg ETH_DMA_TXDESC_STATUS_ALL:    All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_DMA_GetTxDescStatus(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_TXDESC_STATUS(u32Flag));

    if (NULL != pstcTxDesc) {
        if (0UL != (pstcTxDesc->u32ControlStatus & u32Flag)) {
            enFlagSta = SET;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Get DMA Tx descriptor collision count
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32Count              Pointer to DMA Tx collision count
 * @retval int32_t:
 *           - LL_OK: Get collision count success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL or pu32Count == NULL
 */
int32_t ETH_DMA_GetTxDescCollisionCount(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32Count)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcTxDesc) || (NULL == pu32Count)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32Count = (pstcTxDesc->u32ControlStatus >> ETH_DMA_TXDESC_COLLISION_CNT_SHIFT) & ((uint32_t)0x0000000FUL);
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Tx descriptor timestamp.
 * @param  [in] pstcTxDesc              Pointer to a DMA Tx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32High               Timestamp high bit time
 * @param  [out] pu32Low                Timestamp low bit time
 * @retval int32_t:
 *           - LL_OK: Get timestamp success
 *           - LL_ERR_INVD_PARAM: pstcTxDesc == NULL or pu32High == NULL or pu32Low == NULL
 */
int32_t ETH_DMA_GetTxDescTimeStamp(const stc_eth_dma_desc_t *pstcTxDesc, uint32_t *pu32High, uint32_t *pu32Low)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcTxDesc) || (NULL == pu32High) || (NULL == pu32Low)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32Low  = pstcTxDesc->u32TimestampLow;
        *pu32High = pstcTxDesc->u32TimestampHigh;
    }

    return i32Ret;
}

/**
 * @brief  Set DMA Rx descriptor own bit.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Owner                DMA Rx descriptor owner
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_DESC_OWN_CPU: Descriptor is owned by CPU
 *           @arg ETH_DMA_DESC_OWN_DMA: Descriptor is owned by DMA
 * @retval int32_t:
 *           - LL_OK: Set Rx descriptor own bit success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL
 */
int32_t ETH_DMA_SetRxDescOwn(stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Owner)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_DESC_OWN(u32Owner));

        if (ETH_DMA_DESC_OWN_CPU != u32Owner) {
            SET_REG32_BIT(pstcRxDesc->u32ControlStatus, ETH_DMA_RXDESC_OWN);
        } else {
            CLR_REG32_BIT(pstcRxDesc->u32ControlStatus, ETH_DMA_RXDESC_OWN);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable DMA Rx finished interrupt.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *           - LL_OK: Rx interrupt configure success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL
 */
int32_t ETH_DMA_RxDescIntCmd(stc_eth_dma_desc_t *pstcRxDesc, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcRxDesc) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        if (DISABLE != enNewState) {
            CLR_REG32_BIT(pstcRxDesc->u32ControlBufSize, ETH_DMA_RXDESC_DIC);
        } else {
            SET_REG32_BIT(pstcRxDesc->u32ControlBufSize, ETH_DMA_RXDESC_DIC);
        }
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Rx descriptor flag status.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Flag                 DMA Rx descriptor flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_RXDESC_OWN:           OWN bit
 *           @arg ETH_DMA_RXDESC_DAF:           DA Filter Fail for the received frame
 *           @arg ETH_DMA_RXDESC_ERSUM:         Rx Error summary
 *           @arg ETH_DMA_RXDESC_DPE:           Descriptor Error
 *           @arg ETH_DMA_RXDESC_SAF:           SA Filter Fail for the received frame
 *           @arg ETH_DMA_RXDESC_LEE:           Length Error
 *           @arg ETH_DMA_RXDESC_OVE:           Overflow Error
 *           @arg ETH_DMA_RXDESC_VLAT           VLAN Tag
 *           @arg ETH_DMA_RXDESC_RFS:           First descriptor
 *           @arg ETH_DMA_RXDESC_RLS:           Last descriptor
 *           @arg ETH_DMA_RXDESC_IPE_TSPA_GF:   COE Error or Time stamp valid or jumbo frame
 *           @arg ETH_DMA_RXDESC_RLCE:          Late collision Error
 *           @arg ETH_DMA_RXDESC_FRAT:          Frame type
 *           @arg ETH_DMA_RXDESC_WTE:           Receive Watchdog Timeout
 *           @arg ETH_DMA_RXDESC_REE:           Receive error
 *           @arg ETH_DMA_RXDESC_DBE:           Dribble bit error
 *           @arg ETH_DMA_RXDESC_CRE:           CRC error
 *           @arg ETH_DMA_RXDESC_DAS_ESA:       MAC Address Filter/Status bit extension
 *           @arg ETH_DMA_RXDESC_STATUS_ALL:    All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_DMA_GetRxDescStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_RXDESC_STATUS(u32Flag));

    if (NULL != pstcRxDesc) {
        if (0UL != (pstcRxDesc->u32ControlStatus & u32Flag)) {
            enFlagSta = SET;
        }
    }

