RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    return enFlagSta;
}

/**
 * @brief  Get DMA Rx descriptor extend flag status.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u32Flag                 DMA Rx descriptor extend flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_DMA_RXDESC_L4FMS:     L4 Port Filter Status
 *           @arg ETH_DMA_RXDESC_L3FMS:     L3 Address Filter Status
 *           @arg ETH_DMA_RXDESC_TSPD:      Discard Time Stamp
 *           @arg ETH_DMA_RXDESC_PTPV:      PTP Version
 *           @arg ETH_DMA_RXDESC_PTPFT:     PTP Frame Type
 *           @arg ETH_DMA_RXDESC_IPV6DR:    IPv6 Packet Received
 *           @arg ETH_DMA_RXDESC_IPV4DR:    IPv4 Packet Received
 *           @arg ETH_DMA_RXDESC_IPCB:      COE engine Bypassed
 *           @arg ETH_DMA_RXDESC_IPPE:      IP Payload Error
 *           @arg ETH_DMA_RXDESC_IPHE:      IP Header Error
 *           @arg ETH_DMA_RXDESC_EXTEND_STATUS_ALL: All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_DMA_GetRxDescExtendStatus(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_DMA_RXDESC_EXTEND_STATUS(u32Flag));

    if (NULL != pstcRxDesc) {
        if (0UL != (pstcRxDesc->u32ExtendStatus & u32Flag)) {
            enFlagSta = SET;
        }
    }

    return enFlagSta;
}

/**
 * @brief  Get DMA Rx descriptor payload type.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32PayloadType        Pointer to DMA Rx payload type
 *           The payload type may be one of the following values:
 *           - ETH_DMA_RXDESC_IPPT_UNKNOWN: Unknown
 *           - ETH_DMA_RXDESC_IPPT_UDP:     UDP
 *           - ETH_DMA_RXDESC_IPPT_TCP:     TCP
 *           - ETH_DMA_RXDESC_IPPT_ICMP:    ICMP
 * @retval int32_t:
 *           - LL_OK: Get payload type success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL or pu32PayloadType == NULL
 */
int32_t ETH_DMA_GetRxDescPayloadType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32PayloadType)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcRxDesc) || (NULL == pu32PayloadType)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32PayloadType = pstcRxDesc->u32ExtendStatus & ETH_DMA_RXDESC_IPPT;
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Rx descriptor datagram type.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32DatagramType       Pointer to DMA Rx datagram type
 *           The payload type may be one of the following values:
 *           - ETH_DMA_RXDESC_MTP_NONE:                     No PTP messages
 *           - ETH_DMA_RXDESC_MTP_SYNC:                     SYNC message (all clock types)
 *           - ETH_DMA_RXDESC_MTP_FOLLOW_UP:                Follow_Up message (all clock types)
 *           - ETH_DMA_RXDESC_MTP_DELAY_REQ:                Delay_Req message (all clock types)
 *           - ETH_DMA_RXDESC_MTP_DELAY_RESP:               Delay_Resp message (all clock types)
 *           - ETH_DMA_RXDESC_MTP_PDELAY_REQ:               Pdelay_Req message (peer-to-peer transparent clock)
 *           - ETH_DMA_RXDESC_MTP_PDELAY_RESP:              Pdelay_Resp message (peer-to-peer transparent clock)
 *           - ETH_DMA_RXDESC_MTP_PDELAY_RESP_FOLLOW_UP:    Pdelay_Resp_Follow_Up message (peer-to-peer transparent clock)
 *           - ETH_DMA_RXDESC_MTP_ANNOUNCE:                 Announce message (Ordinary or Boundary clock)
 *           - ETH_DMA_RXDESC_MTP_MANAGEMENT:               Management message (Ordinary or Boundary clock)
 *           - ETH_DMA_RXDESC_MTP_SIGNALING:                Signaling message (Ordinary or Boundary clock)
 *           - ETH_DMA_RXDESC_MTP_DEFAULT:                  Default Datagram Type
 * @retval int32_t:
 *           - LL_OK: Get datagram type success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL or pu32DatagramType == NULL
 */
int32_t ETH_DMA_GetRxDescDatagramType(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32DatagramType)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcRxDesc) || (NULL == pu32DatagramType)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32DatagramType = pstcRxDesc->u32ExtendStatus & ETH_DMA_RXDESC_MTP;
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Rx descriptor frame length.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32FrameLen           Pointer to DMA Rx frame length
 * @retval int32_t:
 *           - LL_OK: Get frame length success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL or pu32FrameLen == NULL
 */
int32_t ETH_DMA_GetRxDescFrameLen(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32FrameLen)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcRxDesc) || (NULL == pu32FrameLen)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32FrameLen = (pstcRxDesc->u32ControlStatus >> ETH_DMA_RXDESC_FRAME_LEN_SHIFT) & ((uint32_t)0x00003FFFUL);
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Rx descriptor buffer size.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [in] u8BufNum                Buffer sequence number
 *         This parameter can be one of the following values:
 *           @arg ETH_DMA_DESC_BUF1:    DMA Rx Desc Buffer1
 *           @arg ETH_DMA_DESC_BUF2:    DMA Rx Desc Buffer2
 * @param  [out] pu32BufSize            Pointer to DMA Rx buffer size
 * @retval int32_t:
 *           - LL_OK: Get buffer size success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL or pu32BufSize == NULL
 */
int32_t ETH_DMA_GetRxDescBufSize(const stc_eth_dma_desc_t *pstcRxDesc, uint8_t u8BufNum, uint32_t *pu32BufSize)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32ShiftBit = 0UL;

    if ((NULL == pstcRxDesc) || (NULL == pu32BufSize)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_DMA_DESC_BUF(u8BufNum));

        /* DMA Rx Desc buffer2 */
        if (ETH_DMA_DESC_BUF1 != u8BufNum) {
            u32ShiftBit = ETH_DMA_DESC_BUF2_SIZE_SHIFT;
        }
        *pu32BufSize = (pstcRxDesc->u32ControlBufSize >> u32ShiftBit) & ((uint32_t)0x00001FFFUL);
    }

    return i32Ret;
}

/**
 * @brief  Get DMA Rx descriptor timestamp.
 * @param  [in] pstcRxDesc              Pointer to a DMA Rx descriptor @ref stc_eth_dma_desc_t
 * @param  [out] pu32High               Timestamp high bit time
 * @param  [out] pu32Low                Timestamp low bit time
 * @retval int32_t:
 *           - LL_OK: Get timestamp success
 *           - LL_ERR_INVD_PARAM: pstcRxDesc == NULL or pu32High == NULL or pu32Low == NULL
 */
int32_t ETH_DMA_GetRxDescTimeStamp(const stc_eth_dma_desc_t *pstcRxDesc, uint32_t *pu32High, uint32_t *pu32Low)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pstcRxDesc) || (NULL == pu32High) || (NULL == pu32Low)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32Low  = pstcRxDesc->u32TimestampLow;
        *pu32High = pstcRxDesc->u32TimestampHigh;
    }

    return i32Ret;
}

/******************************************************************************/
/*                                PMT Functions                               */
/******************************************************************************/
/**
 * @brief  Reset PMT wakeup frame pointer.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Reset pointer success
 *           - LL_ERR_TIMEOUT: Reset timeout
 */
int32_t ETH_PMT_ResetWakeupFramePointer(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    WRITE_REG32(bCM_ETH->MAC_PMTCTLR_b.RTWKFR, 1U);
    u32Count = ETH_WR_REG_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bCM_ETH->MAC_PMTCTLR_b.RTWKFR)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    return i32Ret;
}
/**
 * @brief  Write PMT wakeup frame register.
 * @param  [in] au32RegBuf              Pointer to wakeup frame filter register buffer(8 words).
 * @retval int32_t:
 *           - LL_OK: Write register success
 *           - LL_ERR_INVD_PARAM: au32RegBuf == NULL
 */
int32_t ETH_PMT_WriteWakeupFrameReg(const uint32_t au32RegBuf[])
{
    uint32_t i;
    int32_t i32Ret = LL_OK;

    if (NULL == au32RegBuf) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        for (i = 0U; i < ETH_WAKEUP_REG_LEN; i++) {
            WRITE_REG32(CM_ETH->MAC_RTWKFFR, au32RegBuf[i]);
        }
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable PMT forward wakeup frame.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_PMT_ForwardWakeupFrameCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->MAC_PMTCTLR_b.RTWKTR, enNewState);
}

/**
 * @brief  Enable or disable PMT wakeup source.
 * @param  [in] u32WakeupSrc            Wakeup source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PMT_WAKEUP_SRC_GLOBAL_UNICAST:    Global unicast
 *           @arg ETH_PMT_WAKEUP_SRC_WAKEUP_FRAME:      Wake-Up Frame
 *           @arg ETH_PMT_WAKEUP_SRC_MAGIC_PACKET:      Magic Packet
 *           @arg ETH_PMT_WAKEUP_SRC_ALL:               All of the above
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_PMT_WakeupSrcCmd(uint32_t u32WakeupSrc, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PMT_WAKEUP_SRC(u32WakeupSrc));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        SET_REG32_BIT(CM_ETH->MAC_PMTCTLR, u32WakeupSrc);
    } else {
        CLR_REG32_BIT(CM_ETH->MAC_PMTCTLR, u32WakeupSrc);
    }
}

/**
 * @brief  Enable or disable PMT powerdown mode.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Set powerdown mode success
 *           - LL_ERR: Set powerdown mode failed
 */
int32_t ETH_PMT_EnterPowerDown(void)
{
    int32_t i32Ret = LL_ERR;

    if (0UL != READ_REG32(bCM_ETH->MAC_PMTCTLR_b.MPEN)) {
        if (0UL != READ_REG32(bCM_ETH->MAC_PMTCTLR_b.WKEN)) {
            WRITE_REG32(bCM_ETH->MAC_PMTCTLR_b.PWDN, ENABLE);
            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Get PMT flag status.
 * @param  [in] u32Flag                 PMT flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PMT_FLAG_RTWKFR:  Wake-Up Frame Filter Register Pointer Reset
 *           @arg ETH_PMT_FLAG_WKFR:    Wake-Up Frame Received
 *           @arg ETH_PMT_FLAG_MPFR:    Magic Packet Received
 *           @arg ETH_PMT_FLAG_ALL:     All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_PMT_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PMT_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->MAC_PMTCTLR, u32Flag))) {
        enFlagSta = SET;
    }

