RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    return enFlagSta;
}

/******************************************************************************/
/*                                MMC Functions                               */
/******************************************************************************/
/**
 * @brief  De-Initialize MMC.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: MMC De-Initialize success
*           - LL_ERR_TIMEOUT: De-Initialize timeout
 */
int32_t ETH_MMC_DeInit(void)
{
    WRITE_REG32(CM_ETH->MMC_MMCCTLR, 0UL);
    WRITE_REG32(CM_ETH->MMC_RITCTLR, 0UL);
    WRITE_REG32(CM_ETH->MMC_TITCTLR, 0UL);

    return ETH_MMC_CounterReset();
}

/**
 * @brief  Initialize MMC.
 * @param  [in] pstcMmcInit             Pointer to a @ref stc_eth_mmc_init_t structure
 * @retval int32_t:
 *           - LL_OK: MMC Initialize success
 *           - LL_ERR_INVD_PARAM: pstcMmcInit == NULL
 */
int32_t ETH_MMC_Init(const stc_eth_mmc_init_t *pstcMmcInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcMmcInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_MMC_CNT_PRESET_MD(pstcMmcInit->u32PresetMode));
        DDL_ASSERT(IS_ETH_MMC_RD_RST(pstcMmcInit->u32ReadReset));
        DDL_ASSERT(IS_ETH_MMC_CNT_RELOAD(pstcMmcInit->u32Reload));

        MODIFY_REG32(CM_ETH->MMC_MMCCTLR,
                     (ETH_MMC_MMCCTLR_MCPSEL | ETH_MMC_MMCCTLR_MCPSET |
                      ETH_MMC_MMCCTLR_ROR    | ETH_MMC_MMCCTLR_COS),
                     (pstcMmcInit->u32PresetMode | pstcMmcInit->u32ReadReset |
                      pstcMmcInit->u32Reload));
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_mmc_init_t to default values.
 * @param  [out] pstcMmcInit            Pointer to a @ref stc_eth_mmc_init_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcMmcInit == NULL
 */
int32_t ETH_MMC_StructInit(stc_eth_mmc_init_t *pstcMmcInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcMmcInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcMmcInit->u32PresetMode = ETH_MMC_CNT_PRESET_MD_DISABLE;
        pstcMmcInit->u32ReadReset  = ETH_MMC_RD_RST_ENABLE;
        pstcMmcInit->u32Reload = ETH_MMC_CNT_RELOAD_ENABLE;
    }

    return i32Ret;
}

/**
 * @brief  MMC all counter software reset.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Reset success
 *           - LL_ERR_TIMEOUT: Reset timeout
 */
int32_t ETH_MMC_CounterReset(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_OK;

    WRITE_REG32(bCM_ETH->MMC_MMCCTLR_b.CRST, 1U);
    u32Count = ETH_WR_REG_TIMEOUT * (HCLK_VALUE / 20000UL);
    while (0UL != READ_REG32(bCM_ETH->MMC_MMCCTLR_b.CRST)) {
        if (0UL == u32Count) {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
        u32Count--;
    }

    return i32Ret;
}

/**
 * @brief  Enable or disable the reset of all MMC counter after reading.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MMC_ResetAfterReadCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->MMC_MMCCTLR_b.ROR, enNewState);
}

/**
 * @brief  Enable or disable MMC function.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MMC_Cmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        WRITE_REG32(bCM_ETH->MMC_MMCCTLR_b.MCF, DISABLE);
    } else {
        WRITE_REG32(bCM_ETH->MMC_MMCCTLR_b.MCF, ENABLE);
    }
}

/**
 * @brief  Enable or disable MMC transmit interrupt.
 * @param  [in] u32IntType              MMC interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_INT_TXEDEIM:  Tx excessive deferral error frame interrupt
 *           @arg ETH_MMC_INT_TXUGIM:   Tx unicast good frame interrupt
 *           @arg ETH_MMC_INT_TXCAEIM:  Tx carrier error frame interrupt
 *           @arg ETH_MMC_INT_TXECEIM:  Tx excessive collision error frame interrupt
 *           @arg ETH_MMC_INT_TXLCEIM:  Tx deferral collision error frame interrupt
 *           @arg ETH_MMC_INT_TXDEEIM:  Tx deferral error frame interrupt
 *           @arg ETH_MMC_INT_TXMGIM:   Tx multicast good frame interrupt
 *           @arg ETH_MMC_INT_TXBGIM:   Tx broadcast good frame interrupt
 *           @arg ETH_MMC_INT_TX_ALL:   All of the above
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MMC_TxIntCmd(uint32_t u32IntType, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_TX_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        CLR_REG32_BIT(CM_ETH->MMC_TITCTLR, u32IntType);
    } else {
        SET_REG32_BIT(CM_ETH->MMC_TITCTLR, u32IntType);
    }
}

/**
 * @brief  Enable or disable MMC receive interrupt.
 * @param  [in] u32IntType              MMC interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_INT_RXOEIM:   Rx out of scope error frame interrupt
 *           @arg ETH_MMC_INT_RXLEIM:   Rx length error frame interrupt
 *           @arg ETH_MMC_INT_RXUGIM:   Rx unicast good frame interrupt
 *           @arg ETH_MMC_INT_RXREIM:   Rx short error frame interrupt
 *           @arg ETH_MMC_INT_RXAEIM:   Rx alignment error frame interrupt
 *           @arg ETH_MMC_INT_RXCEIM:   Rx crc error frame interrupt
 *           @arg ETH_MMC_INT_RXMGIM:   Rx multicast good frame interrupt
 *           @arg ETH_MMC_INT_RXBGIM:   Rx broadcast good frame interrupt
 *           @arg ETH_MMC_INT_RX_ALL:   All of the above
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_MMC_RxIntCmd(uint32_t u32IntType, en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_RX_INT(u32IntType));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (DISABLE != enNewState) {
        CLR_REG32_BIT(CM_ETH->MMC_RITCTLR, u32IntType);
    } else {
        SET_REG32_BIT(CM_ETH->MMC_RITCTLR, u32IntType);
    }
}

/**
 * @brief  Get MMC flag transmit status.
 * @param  [in] u32Flag                 MMC flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_FLAG_TXEDEIS: Tx excessive deferral error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXUGIS:  Tx unicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXCAEIS: Tx carrier error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXECEIS: Tx excessive collision error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXLCEIS: Tx deferral collision error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXDEEIS: Tx deferral error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXMGIS:  Tx multicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TXBGIS:  Tx broadcast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_TX_ALL:  All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_MMC_GetTxStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_TX_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->MMC_TRSSTSR, u32Flag))) {
        enFlagSta = SET;
    }

