RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    return enFlagSta;
}

/**
 * @brief  Get MMC receive flag status.
 * @param  [in] u32Flag                 MMC flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_MMC_FLAG_RXOEIS:  Rx out of scope error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXLEIS:  Rx length error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXUGIS:  Rx unicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXREIS:  Rx short error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXAEIS:  Rx alignment error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXCEIS:  Rx crc error frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXMGIS:  Rx multicast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RXBGIS:  Rx broadcast good frame counter reaches half or all the maximum value
 *           @arg ETH_MMC_FLAG_RX_ALL:  All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_MMC_GetRxStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_RX_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->MMC_REVSTSR, u32Flag))) {
        enFlagSta = SET;
    }

    return enFlagSta;
}

/**
 * @brief  Get MMC register.
 * @param  [in] u32Reg                  MMC statistics register
 *         This parameter can be one of the following values:
 *           @arg ETH_MMC_REG_TXBRGFR:  Tx broadcast good frame Statistical Register
 *           @arg ETH_MMC_REG_TXMUGFR:  Tx multicast good frame Statistical Register
 *           @arg ETH_MMC_REG_TXDEEFR:  Tx deferral error frame Statistical Register
 *           @arg ETH_MMC_REG_TXLCEFR:  Tx deferral collision error frame Statistical Register
 *           @arg ETH_MMC_REG_TXECEFR:  Tx excessive collision error frame Statistical Register
 *           @arg ETH_MMC_REG_TXCAEFR:  Tx carrier error frame Statistical Register
 *           @arg ETH_MMC_REG_TXUNGFR:  Tx unicast good frame Statistical Register
 *           @arg ETH_MMC_REG_TXEDEFR:  Tx excessive deferral error frame Statistical Register
 *           @arg ETH_MMC_REG_RXBRGFR:  Rx broadcast good frame Statistical Register
 *           @arg ETH_MMC_REG_RXMUGFR:  Rx multicast good frame Statistical Register
 *           @arg ETH_MMC_REG_RXCREFR:  Rx crc error frame Statistical Register
 *           @arg ETH_MMC_REG_RXALEFR:  Rx alignment error frame Statistical Register
 *           @arg ETH_MMC_REG_RXRUEFR:  Rx short error frame Statistical Register
 *           @arg ETH_MMC_REG_RXUNGFR:  Rx unicast good frame Statistical Register
 *           @arg ETH_MMC_REG_RXLEEFR:  Rx length error frame Statistical Register
 *           @arg ETH_MMC_REG_RXOREFR:  Rx out of scope error frame Statistical Register
 * @retval uint32_t                     MMC statistics Register value
 */
uint32_t ETH_MMC_GetReg(uint32_t u32Reg)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_MMC_REG(u32Reg));

    return (*(__IO uint32_t *)((uint32_t)(&CM_ETH->MAC_CONFIGR) + u32Reg));
}

/******************************************************************************/
/*                                PTP Functions                               */
/******************************************************************************/
/**
 * @brief  De-Initialize PTP.
 * @param  None
 * @retval None
 */
void ETH_PTP_DeInit(void)
{
    WRITE_REG32(CM_ETH->PTP_TSPCTLR, 0x00002000UL);
    WRITE_REG32(CM_ETH->PTP_TSPADDR, 0UL);
    WRITE_REG32(CM_ETH->PTP_TSPNSAR, 0UL);
    WRITE_REG32(CM_ETH->PTP_TMUSECR, 0UL);
    WRITE_REG32(CM_ETH->PTP_TMUNSER, 0UL);
}

/**
 * @brief  Initialize PTP.
 * @param  [in] pstcPtpInit             Pointer to a @ref stc_eth_ptp_init_t structure
 * @retval int32_t:
 *           - LL_OK: PTP Initialize success
 *           - LL_ERR: PTP Initialize failed
 *           - LL_ERR_INVD_PARAM: pstcPtpInit == NULL
 */
int32_t ETH_PTP_Init(const stc_eth_ptp_init_t *pstcPtpInit)
{
    int32_t i32Ret;

    if (NULL == pstcPtpInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PTP_DEST_ADDR_FILTER(pstcPtpInit->u32DestAddrFilter));
        DDL_ASSERT(IS_ETH_PTP_DATAGRAM_VER(pstcPtpInit->u32DatagramVersion));
        DDL_ASSERT(IS_ETH_PTP_SUBSEC_SCALE(pstcPtpInit->u32SubsecScale));
        DDL_ASSERT(IS_ETH_PTP_DATAGRAM_TYPE(pstcPtpInit->u32SnapDatagramType));
        DDL_ASSERT(IS_ETH_PTP_FRAME_TYPE(pstcPtpInit->u32SnapFrameType));
        DDL_ASSERT(IS_ETH_PTP_CALIB_MD(pstcPtpInit->u32CalibMode));
        DDL_ASSERT(IS_ETH_PTP_SUB_SEC(pstcPtpInit->u32SubsecInitValue));

        /* Enable timestamp function */
        WRITE_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPEN, (uint32_t)ENABLE);
        /* Set addend value registers */
        WRITE_REG32(CM_ETH->PTP_TSPNSAR, pstcPtpInit->u8SubsecAddend);
        WRITE_REG32(CM_ETH->PTP_TSPADDR, pstcPtpInit->u32BasicAddend);
        i32Ret = ETH_PTP_UpdateBasicAddend();
        if (LL_OK == i32Ret) {
            /* Set timestamp control register */
            MODIFY_REG32(CM_ETH->PTP_TSPCTLR, ETH_PTP_TSPCTLR_CLR_MASK,
                         (pstcPtpInit->u32DestAddrFilter | pstcPtpInit->u32SnapDatagramType |
                          pstcPtpInit->u32SnapFrameType  | pstcPtpInit->u32DatagramVersion  |
                          pstcPtpInit->u32SubsecScale    | pstcPtpInit->u32CalibMode));
            /* Set initialize value */
            WRITE_REG32(CM_ETH->PTP_TMUSECR, pstcPtpInit->u32SecInitValue);
            WRITE_REG32(CM_ETH->PTP_TMUNSER, pstcPtpInit->u32SubsecInitValue);
            i32Ret = ETH_PTP_SysTimeInit();
            if (LL_OK != i32Ret) {
                i32Ret = LL_ERR;
            }
        } else {
            i32Ret = LL_ERR;
        }
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_ptp_init_t to default values.
 * @param  [out] pstcPtpInit            Pointer to a @ref stc_eth_ptp_init_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcPtpInit == NULL
 */
int32_t ETH_PTP_StructInit(stc_eth_ptp_init_t *pstcPtpInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcPtpInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcPtpInit->u32DestAddrFilter      = ETH_PTP_DEST_ADDR_FILTER_DISABLE;
        pstcPtpInit->u32SnapDatagramType    = ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY;
        pstcPtpInit->u32SnapFrameType       = ETH_PTP_FRAME_TYPE_IPV4_FRAME;
        pstcPtpInit->u32DatagramVersion     = ETH_PTP_DATAGRAM_VER_IEEE1588V1;
        pstcPtpInit->u32SubsecScale         = ETH_PTP_SUBSEC_SCALE_HEX;
        pstcPtpInit->u32CalibMode           = ETH_PTP_CALIB_MD_COARSE;
        pstcPtpInit->u32BasicAddend         = 0UL;
        pstcPtpInit->u8SubsecAddend         = 0U;
        pstcPtpInit->u32SecInitValue        = 0UL;
        pstcPtpInit->u32SubsecInitValue     = 0UL;
    }

    return i32Ret;
}

/**
 * @brief  Set PTP snapshot datagram type.
 * @param  [in] u32DatagramType         Snapshot datagram type
 *         This parameter can be one of the following values:
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY:         SYNC Follow_Up Delay_Req Delay_Resp
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC:                      SYNC
 *           @arg ETH_PTP_DATAGRAM_TYPE_DELAY:                     Delay_Req
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_FOLLOW_DELAY_PDELAY:  SYNC Follow_Up Delay_Req Delay_Resp Pdelay_Req Pdelay_Resp Pdelay_Resp_Follow_Up
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_PDELAY:               SYNC Pdelay_Req Pdelay_Resp
 *           @arg ETH_PTP_DATAGRAM_TYPE_DELAY_PDEALY:              Delay_Req Pdelay_Req Pdelay_Resp
 *           @arg ETH_PTP_DATAGRAM_TYPE_SYNC_DELAY:                SYNC Delay_Req
 *           @arg ETH_PTP_DATAGRAM_TYPE_PDELAY:                    Pdelay_Req Pdelay_Resp
 * @retval None
 */
void ETH_PTP_SetSnapDatagramType(uint32_t u32DatagramType)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_DATAGRAM_TYPE(u32DatagramType));

    MODIFY_REG32(CM_ETH->PTP_TSPCTLR, ETH_PTP_TSPCTLR_TSPMTSEL, u32DatagramType);
}

/**
 * @brief  Set PTP snapshot frame type.
 * @param  [in] u32FrameType            Snapshot frame type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PTP_FRAME_TYPE_IPV4_FRAME:    snapshot of IPv4 frame
 *           @arg ETH_PTP_FRAME_TYPE_IPV6_FRAME:    snapshot of IPv6 frame
 *           @arg ETH_PTP_FRAME_TYPE_ETH_FRAME:     snapshot of PTP over ethernet frame
 *           @arg ETH_PTP_FRAME_TYPE_RX_FRAME:      snapshot of all received frame
 *           @arg ETH_PTP_FRAME_TYPE_ALL:           All of the above
 * @retval None
 */
void ETH_PTP_SetSnapFrameType(uint32_t u32FrameType)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_FRAME_TYPE(u32FrameType));

    MODIFY_REG32(CM_ETH->PTP_TSPCTLR,
                 (ETH_PTP_TSPCTLR_TSPOVIPV4 | ETH_PTP_TSPCTLR_TSPOVIPV6 | ETH_PTP_TSPCTLR_TSPOVETH |
                  ETH_PTP_TSPCTLR_TSPEALL), u32FrameType);
}

/**
 * @brief  Set PTP timestamp calibration mode.
 * @param  [in] u32CalibMode            Timestamp calibration mode
 *         This parameter can be one of the following values:
 *           @arg ETH_PTP_CALIB_MD_COARSE:  Coarse calibration
 *           @arg ETH_PTP_CALIB_MD_FINE:    Fine calibration
 * @retval None
 */
void ETH_PTP_SetCalibMode(uint32_t u32CalibMode)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_CALIB_MD(u32CalibMode));

