RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    WRITE_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPUPSEL, u32CalibMode >> ETH_PTP_TSPCTLR_TSPUPSEL_POS);
}

/**
 * @brief  Update PTP timestamp basic addend value.
 * @note   Update Timestamp addend value by basic addend register.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Update timestamp addend value success
 *           - LL_ERR: Current state cannot be updated
 *           - LL_ERR_TIMEOUT: Update timeout
 */
int32_t ETH_PTP_UpdateBasicAddend(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_ERR;

    if (0UL == READ_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPADUP)) {
        WRITE_REG32(bCM_ETH->MMC_MMCCTLR_b.CRST, 1U);
        u32Count = ETH_WR_REG_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32(bCM_ETH->MMC_MMCCTLR_b.CRST)) {
            if (0UL == u32Count) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
            u32Count--;
        }

        if (LL_ERR_TIMEOUT != i32Ret) {
            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Update PTP timestamp system time.
 * @note   Update Timestamp system time by update second and update subsecond registers.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Update timestamp system time success
 *           - LL_ERR: Current state cannot be updated
 *           - LL_ERR_TIMEOUT: Update timeout
 */
int32_t ETH_PTP_UpdateSysTime(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_ERR;

    if (0UL == READ_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPINI)) {
        if (0UL == READ_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPUP)) {
            WRITE_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPUP, 1U);
            u32Count = ETH_WR_REG_TIMEOUT * (HCLK_VALUE / 20000UL);
            while (0UL != READ_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPUP)) {
                if (0UL == u32Count) {
                    i32Ret = LL_ERR_TIMEOUT;
                    break;
                }
                u32Count--;
            }

            if (LL_ERR_TIMEOUT != i32Ret) {
                i32Ret = LL_OK;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief  Initialize PTP timestamp system time.
 * @note   Initialize Timestamp system time by update second and update subsecond registers.
 * @param  None
 * @retval int32_t:
 *           - LL_OK: Initialize timestamp system time success
 *           - LL_ERR: Current state cannot be initialized
 *           - LL_ERR_TIMEOUT: Initialize timeout
 */
int32_t ETH_PTP_SysTimeInit(void)
{
    __IO uint32_t u32Count;
    int32_t i32Ret = LL_ERR;

    if (0UL == READ_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPINI)) {
        WRITE_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPINI, 1U);
        u32Count = ETH_WR_REG_TIMEOUT * (HCLK_VALUE / 20000UL);
        while (0UL != READ_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPINI)) {
            if (0UL == u32Count) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
            u32Count--;
        }

        if (LL_ERR_TIMEOUT != i32Ret) {
            i32Ret = LL_OK;
        }
    }

    return i32Ret;
}

/**
 * @brief  Get PTP timestamp system time.
 * @param  [out] pu32Sec                Pointer to Timestamp system time of Second
 * @param  [out] pu32Subsec             Pointer to Timestamp system time of Subsecond
 * @retval int32_t:
 *           - LL_OK: Get timestamp system time success
 *           - LL_ERR_INVD_PARAM: pu32Sec == NULL or pu32Subsec == NULL
 */
int32_t ETH_PTP_GetSysTime(uint32_t *pu32Sec, uint32_t *pu32Subsec)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pu32Sec) || (NULL == pu32Subsec)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32Sec    = READ_REG32(CM_ETH->PTP_TMSSECR);
        *pu32Subsec = READ_REG32(CM_ETH->PTP_TMSNSER);
    }

    return i32Ret;
}

/**
 * @brief  Set PTP timestamp addend value.
 * @param  [in] u32BasicAddend          Timestamp basic addend value (Between 0x0 and 0xFFFFFFFF)
 * @param  [in] u8SubsecAddend          Timestamp subsecond addend value (Between 0x0 and 0xFF)
 * @retval None
 */
void ETH_PTP_SetBasicAddend(uint32_t u32BasicAddend, uint8_t u8SubsecAddend)
{
    WRITE_REG32(CM_ETH->PTP_TSPADDR, u32BasicAddend);
    WRITE_REG32(CM_ETH->PTP_TSPNSAR, u8SubsecAddend);
}

/**
 * @brief  Get PTP timestamp addend value.
 * @param  [out] pu32BasicAddend        Pointer to basic addend value
 * @param  [out] pu8SubsecAddend        Pointer to subsecond addend value
 * @retval int32_t:
 *           - LL_OK: Get timestamp addend value success
 *           - LL_ERR_INVD_PARAM: pu32BasicAddend == NULL or pu8SubsecAddend == NULL
 */
int32_t ETH_PTP_GetBasicAddend(uint32_t *pu32BasicAddend, uint8_t *pu8SubsecAddend)
{
    int32_t i32Ret = LL_OK;

    if ((NULL == pu32BasicAddend) || (NULL == pu8SubsecAddend)) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        *pu32BasicAddend = READ_REG32(CM_ETH->PTP_TSPADDR);
        *pu8SubsecAddend = (uint8_t)(READ_REG32(CM_ETH->PTP_TSPNSAR) & ETH_PTP_TSPNSAR_TSPNSEADD);
    }

    return i32Ret;
}

/**
 * @brief  Set PTP timestamp update time.
 * @param  [in] u32Sign                 Timestamp Update Sign
 *           @arg ETH_PTP_TIME_UPDATE_SIGN_MINUS:   Minus
 *           @arg ETH_PTP_TIME_UPDATE_SIGN_PLUS:    Plus
 * @param  [in] u32Sec                  Update time of Second (Between 0x0 and 0xFFFFFFFF)
 * @param  [in] u32Subsec               Update time of Subsecond (Between 0x0 and 0x7FFFFFFF)
 * @retval None
 */
void ETH_PTP_SetUpdateTime(uint32_t u32Sign, uint32_t u32Sec, uint32_t u32Subsec)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_TIME_UPDATE_SIGN(u32Sign));
    DDL_ASSERT(IS_ETH_PTP_SUB_SEC(u32Subsec));

    WRITE_REG32(CM_ETH->PTP_TMUSECR, u32Sec);
    WRITE_REG32(CM_ETH->PTP_TMUNSER, (u32Sign | u32Subsec));
}

/**
 * @brief  Enable or disable PTP function.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_PTP_Cmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

