RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/hc32_ll_driver/src/hc32_ll_eth.c
    WRITE_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPEN, enNewState);
}

/**
 * @brief  Enable or disable PTP interrupt.
 * @param  [in] enNewState              An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void ETH_PTP_IntCmd(en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    WRITE_REG32(bCM_ETH->PTP_TSPCTLR_b.TSPINT, enNewState);
}

/**
 * @brief  Get PTP flag status.
 * @param  [in] u32Flag                 PTP flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg ETH_PTP_FLAG_TSERR1:  Target time 1 error
 *           @arg ETH_PTP_FLAG_TSTAR1:  Target time 1 reached
 *           @arg ETH_PTP_FLAG_TSERR0:  Target time 0 error
 *           @arg ETH_PTP_FLAG_TSTAR0:  Target time 0 reached
 *           @arg ETH_PTP_FLAG_TSOVF:   System time overflow
 *           @arg ETH_PTP_FLAG_ALL:     All of the above
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t ETH_PTP_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enFlagSta = RESET;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PTP_FLAG(u32Flag));

    if (0UL != (READ_REG32_BIT(CM_ETH->PTP_TSPSTSR, u32Flag))) {
        enFlagSta = SET;
    }

    return enFlagSta;
}

/******************************************************************************/
/*                            PTP PPS Functions                               */
/******************************************************************************/
/**
 * @brief  De-Initialize PTP PPS.
 * @param  [in] u8Ch                    PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_CH0:          PPS Channel 0
 *           @arg ETH_PPS_CH1:          PPS Channel 1
 * @retval None
 */
void ETH_PPS_DeInit(uint8_t u8Ch)
{
    uint32_t u32ShiftStep = 0UL;
    uint32_t u32ShiftBit = 0UL;
    __IO uint32_t *PTP_TMTSECR;
    __IO uint32_t *PTP_TMTNSER;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_CH(u8Ch));

    if (ETH_PPS_CH1 == u8Ch) {
        u32ShiftBit  = ETH_PTP_PPSCTLR_PPSFRE1_POS;
        u32ShiftStep = ETH_PTP_PPS1_TIME_REG_ADDR_SHIFT;
    }
    CLR_REG32_BIT(CM_ETH->PTP_PPSCTLR,
                  ((ETH_PTP_PPSCTLR_PPSFRE0 | ETH_PTP_PPSCTLR_PPSOMD | ETH_PTP_PPSCTLR_TT0SEL) << u32ShiftBit));
    /* Clear target time registers */
    PTP_TMTSECR = ETH_PTP_TMTSECR_ADDR(u32ShiftStep);
    PTP_TMTNSER = ETH_PTP_TMTNSER_ADDR(u32ShiftStep);
    WRITE_REG32(*PTP_TMTSECR, 0UL);
    WRITE_REG32(*PTP_TMTNSER, 0UL);
}

/**
 * @brief  Initialize PTP PPS.
 * @param  [in] u8Ch                    PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_CH0:          PPS Channel 0
 *           @arg ETH_PPS_CH1:          PPS Channel 1
 * @param  [in] pstcPpsInit             Pointer to a @ref stc_eth_pps_config_t structure
 * @retval int32_t:
 *           - LL_OK: PPS Initialize success
 *           - LL_ERR_INVD_PARAM: pstcPpsInit == NULL
 */
int32_t ETH_PPS_Init(uint8_t u8Ch, const stc_eth_pps_config_t *pstcPpsInit)
{
    int32_t i32Ret = LL_OK;
    uint32_t u32ShiftStep = 0UL;
    uint32_t u32ShiftBit = 0UL;
    uint32_t u32RegVal;
    __IO uint32_t *PTP_TMTSECR;
    __IO uint32_t *PTP_TMTNSER;

    if (NULL == pstcPpsInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        /* Check parameters */
        DDL_ASSERT(IS_ETH_PPS_CH(u8Ch));
        DDL_ASSERT(IS_ETH_PTP_SUB_SEC(pstcPpsInit->u32SubsecValue));
        DDL_ASSERT(IS_ETH_PPS_TRIG_FUNC(pstcPpsInit->u32TriggerFunc));
        DDL_ASSERT(IS_ETH_PPS_OUTPUT_MD(pstcPpsInit->u32OutputMode));
        DDL_ASSERT(IS_ETH_PPS_OUTPUT_FREQ(pstcPpsInit->u32OutputFreq));
        DDL_ASSERT(IS_ETH_PPS1_COMPLEX_FUNC(u8Ch, pstcPpsInit->u32OutputMode, pstcPpsInit->u32OutputFreq));

        u32RegVal = pstcPpsInit->u32OutputFreq | pstcPpsInit->u32TriggerFunc;
        if (ETH_PPS_CH1 == u8Ch) {
            u32ShiftBit  = ETH_PTP_PPSCTLR_PPSFRE1_POS;
            u32ShiftStep = ETH_PTP_PPS1_TIME_REG_ADDR_SHIFT;
        } else {
            u32RegVal |= pstcPpsInit->u32OutputMode;
        }
        MODIFY_REG32(CM_ETH->PTP_PPSCTLR,
                     ((ETH_PTP_PPSCTLR_PPSFRE0 | ETH_PTP_PPSCTLR_PPSOMD | ETH_PTP_PPSCTLR_TT0SEL) << u32ShiftBit),
                     (u32RegVal << u32ShiftBit));
        /* Set target time registers */
        PTP_TMTSECR = ETH_PTP_TMTSECR_ADDR(u32ShiftStep);
        PTP_TMTNSER = ETH_PTP_TMTNSER_ADDR(u32ShiftStep);
        WRITE_REG32(*PTP_TMTSECR, pstcPpsInit->u32SecValue);
        WRITE_REG32(*PTP_TMTNSER, pstcPpsInit->u32SubsecValue);
    }

    return i32Ret;
}

/**
 * @brief  Set the fields of structure stc_eth_pps_config_t to default values.
 * @param  [out] pstcPpsInit            Pointer to a @ref stc_eth_pps_config_t structure
 * @retval int32_t:
 *           - LL_OK: Structure Initialize success
 *           - LL_ERR_INVD_PARAM: pstcPpsInit == NULL
 */
int32_t ETH_PPS_StructInit(stc_eth_pps_config_t *pstcPpsInit)
{
    int32_t i32Ret = LL_OK;

    if (NULL == pstcPpsInit) {
        i32Ret = LL_ERR_INVD_PARAM;
    } else {
        pstcPpsInit->u32TriggerFunc = ETH_PPS_TRIG_FUNC_INT_EVT;
        pstcPpsInit->u32OutputMode  = ETH_PPS_OUTPUT_MD_ONCE;
        pstcPpsInit->u32OutputFreq  = ETH_PPS_OUTPUT_ONE_PULSE;
        pstcPpsInit->u32SecValue    = 0UL;
        pstcPpsInit->u32SubsecValue = 0UL;
    }

    return i32Ret;
}

/**
 * @brief  Set PTP Target time function.
 * @param  [in] u8Ch                    PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_CH0:          PPS Channel 0
 *           @arg ETH_PPS_CH1:          PPS Channel 1
 * @param  [in] u32Sec                  Target time of Second (Between 0x0 and 0xFFFFFFFF)
 * @param  [in] u32Subsec               Target time of Subsecond (Between 0x0 and 0x7FFFFFFF)
 * @retval None
 */
void ETH_PPS_SetTargetTime(uint8_t u8Ch, uint32_t u32Sec, uint32_t u32Subsec)
{
    uint32_t u32ShiftStep = 0UL;
    __IO uint32_t *PTP_TMTSECR;
    __IO uint32_t *PTP_TMTNSER;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_CH(u8Ch));
    DDL_ASSERT(IS_ETH_PTP_SUB_SEC(u32Subsec));

    if (ETH_PPS_CH1 == u8Ch) {
        u32ShiftStep = ETH_PTP_PPS1_TIME_REG_ADDR_SHIFT;
    }
    PTP_TMTSECR = ETH_PTP_TMTSECR_ADDR(u32ShiftStep);
    PTP_TMTNSER = ETH_PTP_TMTNSER_ADDR(u32ShiftStep);
    WRITE_REG32(*PTP_TMTSECR, u32Sec);
    WRITE_REG32(*PTP_TMTNSER, u32Subsec);
}

/**
 * @brief  Set PTP Target time function.
 * @param  [in] u8Ch                    PPS output channel
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_CH0:          PPS Channel 0
 *           @arg ETH_PPS_CH1:          PPS Channel 1
 * @param  [in] u32Func                 Arrival time trigger the function
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_TRIG_FUNC_INT_EVT:      Interrupt output event
 *           @arg ETH_PPS_TRIG_FUNC_INT_PPS_EVT:  Interrupt out event and PPS single output event
 *           @arg ETH_PPS_TRIG_FUNC_PPS_EVT:      PPS Single output event
 * @retval None
 */
void ETH_PPS_SetTriggerFunc(uint8_t u8Ch, uint32_t u32Func)
{
    uint32_t u32ShiftBit = 0UL;

    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_CH(u8Ch));
    DDL_ASSERT(IS_ETH_PPS_TRIG_FUNC(u32Func));

    if (ETH_PPS_CH1 == u8Ch) {
        u32ShiftBit = ETH_PTP_PPSCTLR_PPSFRE1_POS;
    }
    MODIFY_REG32(CM_ETH->PTP_PPSCTLR, (ETH_PTP_PPSCTLR_TT0SEL << u32ShiftBit), (u32Func << u32ShiftBit));
}

/**
 * @brief  Set PTP PPS0 output mode.
 * @param  [in] u32Mode                 PPS output mode
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_OUTPUT_MD_CONTINUE:   Continuous output mode
 *           @arg ETH_PPS_OUTPUT_MD_ONCE:       Single output mode
 * @retval None
 */
void ETH_PPS_SetPps0OutputMode(uint32_t u32Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_OUTPUT_MD(u32Mode));

    WRITE_REG32(bCM_ETH->PTP_PPSCTLR_b.PPSOMD, u32Mode >> ETH_PTP_PPSCTLR_PPSOMD_POS);
}

/**
 * @brief  Set PTP PPS0 output frequency.
 * @param  [in] u32Freq                 PPS output frequency
 *         This parameter can be one of the following values:
 *           @arg ETH_PPS_OUTPUT_FREQ_1HZ:      Ouput pulse is 1HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_2HZ:      Ouput pulse is 2HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_4HZ:      Ouput pulse is 4HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_8HZ:      Ouput pulse is 8HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_16HZ:     Ouput pulse is 16HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_32HZ:     Ouput pulse is 32HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_64HZ:     Ouput pulse is 64HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_128HZ:    Ouput pulse is 128HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_256HZ:    Ouput pulse is 256HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_512HZ:    Ouput pulse is 512HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_1024HZ:   Ouput pulse is 1024HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_2048HZ:   Ouput pulse is 2048HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_4096HZ:   Ouput pulse is 4096HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_8192HZ:   Ouput pulse is 8192HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_16384HZ:  Ouput pulse is 16384HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_FREQ_32768HZ:  Ouput pulse is 32768HZ in continuous ouput mode
 *           @arg ETH_PPS_OUTPUT_ONE_PULSE:     One pulse is generated in single ouput mode
 * @retval None
 */
void ETH_PPS_SetPps0OutputFreq(uint32_t u32Freq)
{
    /* Check parameters */
    DDL_ASSERT(IS_ETH_PPS_OUTPUT_FREQ(u32Freq));

    MODIFY_REG32(CM_ETH->PTP_PPSCTLR, ETH_PTP_PPSCTLR_PPSFRE0, u32Freq);
}

/**
 * @}
 */

#endif /* LL_ETH_ENABLE */

/**
 * @}
 */

/**
 * @}
 */

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
